program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 256, 80]> audio_chunk, tensor<fp16, [1, 1, 256]> predictor_hidden_in, tensor<fp16, [1, 1]> token_in) {
            tensor<int32, [3]> input_1_perm_0 = const()[name = tensor<string, []>("input_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [1]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 80, 5]> model_frontend_conv_network_0_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_0_weight_to_fp16"), val = tensor<fp16, [256, 80, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [256]> model_frontend_conv_network_0_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(204928)))];
            tensor<fp16, [1, 80, 256]> input_1_cast_fp16 = transpose(perm = input_1_perm_0, x = audio_chunk)[name = tensor<string, []>("transpose_787")];
            tensor<fp16, [1, 256, 128]> input_3_cast_fp16 = conv(bias = model_frontend_conv_network_0_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = model_frontend_conv_network_0_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_mode_0 = const()[name = tensor<string, []>("input_5_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 128]> input_5_cast_fp16 = gelu(mode = input_5_mode_0, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [1]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 5]> model_frontend_conv_network_2_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_2_weight_to_fp16"), val = tensor<fp16, [256, 256, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(205504)))];
            tensor<fp16, [256]> model_frontend_conv_network_2_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(860928)))];
            tensor<fp16, [1, 256, 64]> input_7_cast_fp16 = conv(bias = model_frontend_conv_network_2_bias_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = model_frontend_conv_network_2_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_mode_0 = const()[name = tensor<string, []>("input_9_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 64]> input_9_cast_fp16 = gelu(mode = input_9_mode_0, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 3]> model_frontend_conv_network_4_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_4_weight_to_fp16"), val = tensor<fp16, [256, 256, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(861504)))];
            tensor<fp16, [256]> model_frontend_conv_network_4_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_4_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1254784)))];
            tensor<fp16, [1, 256, 64]> input_11_cast_fp16 = conv(bias = model_frontend_conv_network_4_bias_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = model_frontend_conv_network_4_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> conv_output_mode_0 = const()[name = tensor<string, []>("conv_output_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 64]> conv_output_cast_fp16 = gelu(mode = conv_output_mode_0, x = input_11_cast_fp16)[name = tensor<string, []>("conv_output_cast_fp16")];
            tensor<int32, [3]> input_13_perm_0 = const()[name = tensor<string, []>("input_13_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_1_axes_0 = const()[name = tensor<string, []>("x_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> model_frontend_output_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_output_norm_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1255360)))];
            tensor<fp16, [256]> model_frontend_output_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_output_norm_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1255936)))];
            tensor<fp16, []> var_23_to_fp16 = const()[name = tensor<string, []>("op_23_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 64, 256]> input_13_cast_fp16 = transpose(perm = input_13_perm_0, x = conv_output_cast_fp16)[name = tensor<string, []>("transpose_786")];
            tensor<fp16, [1, 64, 256]> x_1_cast_fp16 = layer_norm(axes = x_1_axes_0, beta = model_frontend_output_norm_bias_to_fp16, epsilon = var_23_to_fp16, gamma = model_frontend_output_norm_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<fp32, []> var_77 = const()[name = tensor<string, []>("op_77"), val = tensor<fp32, []>(0x1.2a05f2p+33)];
            tensor<fp16, [256, 256]> model_encoder_blocks_0_in_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_in_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1256512)))];
            tensor<fp16, [256]> model_encoder_blocks_0_in_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_in_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1387648)))];
            tensor<fp16, [1, 64, 256]> linear_0_cast_fp16 = linear(bias = model_encoder_blocks_0_in_proj_bias_to_fp16, weight = model_encoder_blocks_0_in_proj_weight_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [256, 256]> model_encoder_blocks_0_z_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_z_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1388224)))];
            tensor<fp16, [256]> model_encoder_blocks_0_z_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_z_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1519360)))];
            tensor<fp16, [1, 64, 256]> linear_1_cast_fp16 = linear(bias = model_encoder_blocks_0_z_proj_bias_to_fp16, weight = model_encoder_blocks_0_z_proj_weight_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [3]> input_15_perm_0 = const()[name = tensor<string, []>("input_15_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> var_178_pad_type_0 = const()[name = tensor<string, []>("op_178_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> var_178_strides_0 = const()[name = tensor<string, []>("op_178_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> var_178_pad_0 = const()[name = tensor<string, []>("op_178_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> var_178_dilations_0 = const()[name = tensor<string, []>("op_178_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_178_groups_0 = const()[name = tensor<string, []>("op_178_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1]> model_encoder_blocks_0_B_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_B_conv_weight_to_fp16"), val = tensor<fp16, [16, 256, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1519936)))];
            tensor<fp16, [16]> model_encoder_blocks_0_B_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_B_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528192)))];
            tensor<fp16, [1, 256, 64]> input_15_cast_fp16 = transpose(perm = input_15_perm_0, x = linear_0_cast_fp16)[name = tensor<string, []>("transpose_785")];
            tensor<fp16, [1, 16, 64]> var_178_cast_fp16 = conv(bias = model_encoder_blocks_0_B_conv_bias_to_fp16, dilations = var_178_dilations_0, groups = var_178_groups_0, pad = var_178_pad_0, pad_type = var_178_pad_type_0, strides = var_178_strides_0, weight = model_encoder_blocks_0_B_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_178_cast_fp16")];
            tensor<int32, [3]> B_proj_1_perm_0 = const()[name = tensor<string, []>("B_proj_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> var_186_pad_type_0 = const()[name = tensor<string, []>("op_186_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> var_186_strides_0 = const()[name = tensor<string, []>("op_186_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> var_186_pad_0 = const()[name = tensor<string, []>("op_186_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> var_186_dilations_0 = const()[name = tensor<string, []>("op_186_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_186_groups_0 = const()[name = tensor<string, []>("op_186_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1]> model_encoder_blocks_0_C_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_C_conv_weight_to_fp16"), val = tensor<fp16, [16, 256, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528320)))];
            tensor<fp16, [16]> model_encoder_blocks_0_C_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_C_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536576)))];
            tensor<fp16, [1, 16, 64]> var_186_cast_fp16 = conv(bias = model_encoder_blocks_0_C_conv_bias_to_fp16, dilations = var_186_dilations_0, groups = var_186_groups_0, pad = var_186_pad_0, pad_type = var_186_pad_type_0, strides = var_186_strides_0, weight = model_encoder_blocks_0_C_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_186_cast_fp16")];
            tensor<int32, [3]> C_proj_1_perm_0 = const()[name = tensor<string, []>("C_proj_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1, 64, 256]> delta_positive_1_cast_fp16 = softplus(x = linear_0_cast_fp16)[name = tensor<string, []>("delta_positive_1_cast_fp16")];
            tensor<fp16, []> var_76_to_fp16 = const()[name = tensor<string, []>("op_76_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(inf)];
            tensor<fp16, [1, 64, 256]> clip_0_cast_fp16 = clip(alpha = var_76_to_fp16, beta = const_2_to_fp16, x = delta_positive_1_cast_fp16)[name = tensor<string, []>("clip_0_cast_fp16")];
            tensor<int32, [1]> var_193_axes_0 = const()[name = tensor<string, []>("op_193_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 64, 256, 1]> var_193_cast_fp16 = expand_dims(axes = var_193_axes_0, x = clip_0_cast_fp16)[name = tensor<string, []>("op_193_cast_fp16")];
            tensor<fp16, [1, 1, 256, 16]> var_197_to_fp16 = const()[name = tensor<string, []>("op_197_to_fp16"), val = tensor<fp16, [1, 1, 256, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536704)))];
            tensor<fp16, [1, 64, 256, 16]> var_198_cast_fp16 = mul(x = var_193_cast_fp16, y = var_197_to_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<fp16, [1, 64, 256, 16]> delta_A_1_cast_fp16 = exp(x = var_198_cast_fp16)[name = tensor<string, []>("delta_A_1_cast_fp16")];
            tensor<string, []> delta_A_1_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("delta_A_1_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp32, []> const_5 = const()[name = tensor<string, []>("const_5"), val = tensor<fp32, []>(-0x1.fffffep+127)];
            tensor<fp32, [1, 64, 256, 16]> delta_A_1_cast_fp16_to_fp32 = cast(dtype = delta_A_1_cast_fp16_to_fp32_dtype_0, x = delta_A_1_cast_fp16)[name = tensor<string, []>("cast_36")];
            tensor<fp32, [1, 64, 256, 16]> clip_1 = clip(alpha = const_5, beta = var_77, x = delta_A_1_cast_fp16_to_fp32)[name = tensor<string, []>("clip_1")];
            tensor<fp16, [1, 64, 256]> delta_u_1_cast_fp16 = mul(x = clip_0_cast_fp16, y = linear_0_cast_fp16)[name = tensor<string, []>("delta_u_1_cast_fp16")];
            tensor<int32, [1]> delta_u_scalar_1_axes_0 = const()[name = tensor<string, []>("delta_u_scalar_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, []> delta_u_scalar_1_keep_dims_0 = const()[name = tensor<string, []>("delta_u_scalar_1_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 64, 1]> delta_u_scalar_1_cast_fp16 = reduce_mean(axes = delta_u_scalar_1_axes_0, keep_dims = delta_u_scalar_1_keep_dims_0, x = delta_u_1_cast_fp16)[name = tensor<string, []>("delta_u_scalar_1_cast_fp16")];
            tensor<int32, [1]> var_204_axes_0 = const()[name = tensor<string, []>("op_204_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 64, 1, 1]> var_204_cast_fp16 = expand_dims(axes = var_204_axes_0, x = delta_u_scalar_1_cast_fp16)[name = tensor<string, []>("op_204_cast_fp16")];
            tensor<int32, [1]> var_205_axes_0 = const()[name = tensor<string, []>("op_205_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 16]> B_proj_1_cast_fp16 = transpose(perm = B_proj_1_perm_0, x = var_178_cast_fp16)[name = tensor<string, []>("transpose_784")];
            tensor<fp16, [1, 64, 1, 16]> var_205_cast_fp16 = expand_dims(axes = var_205_axes_0, x = B_proj_1_cast_fp16)[name = tensor<string, []>("op_205_cast_fp16")];
            tensor<fp16, [1, 64, 1, 16]> delta_B_u_1_cast_fp16 = mul(x = var_204_cast_fp16, y = var_205_cast_fp16)[name = tensor<string, []>("delta_B_u_1_cast_fp16")];
            tensor<int32, [4]> var_209_begin_0 = const()[name = tensor<string, []>("op_209_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_209_end_0 = const()[name = tensor<string, []>("op_209_end_0"), val = tensor<int32, [4]>([1, 1, 256, 16])];
            tensor<bool, [4]> var_209_end_mask_0 = const()[name = tensor<string, []>("op_209_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_209_squeeze_mask_0 = const()[name = tensor<string, []>("op_209_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<string, []> clip_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("clip_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 64, 256, 16]> clip_1_to_fp16 = cast(dtype = clip_1_to_fp16_dtype_0, x = clip_1)[name = tensor<string, []>("cast_35")];
            tensor<fp16, [1, 256, 16]> var_209_cast_fp16 = slice_by_index(begin = var_209_begin_0, end = var_209_end_0, end_mask = var_209_end_mask_0, squeeze_mask = var_209_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_209_cast_fp16")];
            tensor<fp16, [1, 256, 16]> h0_1_to_fp16 = const()[name = tensor<string, []>("h0_1_to_fp16"), val = tensor<fp16, [1, 256, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1544960)))];
            tensor<fp16, [1, 256, 16]> var_210_cast_fp16 = mul(x = var_209_cast_fp16, y = h0_1_to_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<int32, [4]> var_212_begin_0 = const()[name = tensor<string, []>("op_212_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_212_end_0 = const()[name = tensor<string, []>("op_212_end_0"), val = tensor<int32, [4]>([1, 1, 1, 16])];
            tensor<bool, [4]> var_212_end_mask_0 = const()[name = tensor<string, []>("op_212_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_212_squeeze_mask_0 = const()[name = tensor<string, []>("op_212_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_212_cast_fp16 = slice_by_index(begin = var_212_begin_0, end = var_212_end_0, end_mask = var_212_end_mask_0, squeeze_mask = var_212_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_212_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_3_cast_fp16 = add(x = var_210_cast_fp16, y = var_212_cast_fp16)[name = tensor<string, []>("hidden_state_3_cast_fp16")];
            tensor<int32, [3]> var_215_begin_0 = const()[name = tensor<string, []>("op_215_begin_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<int32, [3]> var_215_end_0 = const()[name = tensor<string, []>("op_215_end_0"), val = tensor<int32, [3]>([1, 1, 16])];
            tensor<bool, [3]> var_215_end_mask_0 = const()[name = tensor<string, []>("op_215_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_215_squeeze_mask_0 = const()[name = tensor<string, []>("op_215_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 64, 16]> C_proj_1_cast_fp16 = transpose(perm = C_proj_1_perm_0, x = var_186_cast_fp16)[name = tensor<string, []>("transpose_783")];
            tensor<fp16, [1, 16]> var_215_cast_fp16 = slice_by_index(begin = var_215_begin_0, end = var_215_end_0, end_mask = var_215_end_mask_0, squeeze_mask = var_215_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_215_cast_fp16")];
            tensor<int32, [3]> concat_4 = const()[name = tensor<string, []>("concat_4"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_1_cast_fp16 = reshape(shape = concat_4, x = var_215_cast_fp16)[name = tensor<string, []>("reshape_1_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = hidden_state_3_cast_fp16, y = reshape_1_cast_fp16)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, [2]> concat_7 = const()[name = tensor<string, []>("concat_7"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_2_cast_fp16 = reshape(shape = concat_7, x = matmul_0_cast_fp16)[name = tensor<string, []>("reshape_2_cast_fp16")];
            tensor<int32, [4]> var_220_begin_0 = const()[name = tensor<string, []>("op_220_begin_0"), val = tensor<int32, [4]>([0, 1, 0, 0])];
            tensor<int32, [4]> var_220_end_0 = const()[name = tensor<string, []>("op_220_end_0"), val = tensor<int32, [4]>([1, 2, 256, 16])];
            tensor<bool, [4]> var_220_end_mask_0 = const()[name = tensor<string, []>("op_220_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_220_squeeze_mask_0 = const()[name = tensor<string, []>("op_220_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_220_cast_fp16 = slice_by_index(begin = var_220_begin_0, end = var_220_end_0, end_mask = var_220_end_mask_0, squeeze_mask = var_220_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_220_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_221_cast_fp16 = mul(x = var_220_cast_fp16, y = hidden_state_3_cast_fp16)[name = tensor<string, []>("op_221_cast_fp16")];
            tensor<int32, [4]> var_223_begin_0 = const()[name = tensor<string, []>("op_223_begin_0"), val = tensor<int32, [4]>([0, 1, 0, 0])];
            tensor<int32, [4]> var_223_end_0 = const()[name = tensor<string, []>("op_223_end_0"), val = tensor<int32, [4]>([1, 2, 1, 16])];
            tensor<bool, [4]> var_223_end_mask_0 = const()[name = tensor<string, []>("op_223_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_223_squeeze_mask_0 = const()[name = tensor<string, []>("op_223_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_223_cast_fp16 = slice_by_index(begin = var_223_begin_0, end = var_223_end_0, end_mask = var_223_end_mask_0, squeeze_mask = var_223_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_223_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_5_cast_fp16 = add(x = var_221_cast_fp16, y = var_223_cast_fp16)[name = tensor<string, []>("hidden_state_5_cast_fp16")];
            tensor<int32, [3]> var_226_begin_0 = const()[name = tensor<string, []>("op_226_begin_0"), val = tensor<int32, [3]>([0, 1, 0])];
            tensor<int32, [3]> var_226_end_0 = const()[name = tensor<string, []>("op_226_end_0"), val = tensor<int32, [3]>([1, 2, 16])];
            tensor<bool, [3]> var_226_end_mask_0 = const()[name = tensor<string, []>("op_226_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_226_squeeze_mask_0 = const()[name = tensor<string, []>("op_226_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_226_cast_fp16 = slice_by_index(begin = var_226_begin_0, end = var_226_end_0, end_mask = var_226_end_mask_0, squeeze_mask = var_226_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_226_cast_fp16")];
            tensor<int32, [3]> concat_12 = const()[name = tensor<string, []>("concat_12"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_4_cast_fp16 = reshape(shape = concat_12, x = var_226_cast_fp16)[name = tensor<string, []>("reshape_4_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = hidden_state_5_cast_fp16, y = reshape_4_cast_fp16)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, [2]> concat_15 = const()[name = tensor<string, []>("concat_15"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_5_cast_fp16 = reshape(shape = concat_15, x = matmul_1_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<int32, [4]> var_231_begin_0 = const()[name = tensor<string, []>("op_231_begin_0"), val = tensor<int32, [4]>([0, 2, 0, 0])];
            tensor<int32, [4]> var_231_end_0 = const()[name = tensor<string, []>("op_231_end_0"), val = tensor<int32, [4]>([1, 3, 256, 16])];
            tensor<bool, [4]> var_231_end_mask_0 = const()[name = tensor<string, []>("op_231_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_231_squeeze_mask_0 = const()[name = tensor<string, []>("op_231_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_231_cast_fp16 = slice_by_index(begin = var_231_begin_0, end = var_231_end_0, end_mask = var_231_end_mask_0, squeeze_mask = var_231_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_231_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_232_cast_fp16 = mul(x = var_231_cast_fp16, y = hidden_state_5_cast_fp16)[name = tensor<string, []>("op_232_cast_fp16")];
            tensor<int32, [4]> var_234_begin_0 = const()[name = tensor<string, []>("op_234_begin_0"), val = tensor<int32, [4]>([0, 2, 0, 0])];
            tensor<int32, [4]> var_234_end_0 = const()[name = tensor<string, []>("op_234_end_0"), val = tensor<int32, [4]>([1, 3, 1, 16])];
            tensor<bool, [4]> var_234_end_mask_0 = const()[name = tensor<string, []>("op_234_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_234_squeeze_mask_0 = const()[name = tensor<string, []>("op_234_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_234_cast_fp16 = slice_by_index(begin = var_234_begin_0, end = var_234_end_0, end_mask = var_234_end_mask_0, squeeze_mask = var_234_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_7_cast_fp16 = add(x = var_232_cast_fp16, y = var_234_cast_fp16)[name = tensor<string, []>("hidden_state_7_cast_fp16")];
            tensor<int32, [3]> var_237_begin_0 = const()[name = tensor<string, []>("op_237_begin_0"), val = tensor<int32, [3]>([0, 2, 0])];
            tensor<int32, [3]> var_237_end_0 = const()[name = tensor<string, []>("op_237_end_0"), val = tensor<int32, [3]>([1, 3, 16])];
            tensor<bool, [3]> var_237_end_mask_0 = const()[name = tensor<string, []>("op_237_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_237_squeeze_mask_0 = const()[name = tensor<string, []>("op_237_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_237_cast_fp16 = slice_by_index(begin = var_237_begin_0, end = var_237_end_0, end_mask = var_237_end_mask_0, squeeze_mask = var_237_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_237_cast_fp16")];
            tensor<int32, [3]> concat_20 = const()[name = tensor<string, []>("concat_20"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_7_cast_fp16 = reshape(shape = concat_20, x = var_237_cast_fp16)[name = tensor<string, []>("reshape_7_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = hidden_state_7_cast_fp16, y = reshape_7_cast_fp16)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, [2]> concat_23 = const()[name = tensor<string, []>("concat_23"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_8_cast_fp16 = reshape(shape = concat_23, x = matmul_2_cast_fp16)[name = tensor<string, []>("reshape_8_cast_fp16")];
            tensor<int32, [4]> var_242_begin_0 = const()[name = tensor<string, []>("op_242_begin_0"), val = tensor<int32, [4]>([0, 3, 0, 0])];
            tensor<int32, [4]> var_242_end_0 = const()[name = tensor<string, []>("op_242_end_0"), val = tensor<int32, [4]>([1, 4, 256, 16])];
            tensor<bool, [4]> var_242_end_mask_0 = const()[name = tensor<string, []>("op_242_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_242_squeeze_mask_0 = const()[name = tensor<string, []>("op_242_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_242_cast_fp16 = slice_by_index(begin = var_242_begin_0, end = var_242_end_0, end_mask = var_242_end_mask_0, squeeze_mask = var_242_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_242_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_243_cast_fp16 = mul(x = var_242_cast_fp16, y = hidden_state_7_cast_fp16)[name = tensor<string, []>("op_243_cast_fp16")];
            tensor<int32, [4]> var_245_begin_0 = const()[name = tensor<string, []>("op_245_begin_0"), val = tensor<int32, [4]>([0, 3, 0, 0])];
            tensor<int32, [4]> var_245_end_0 = const()[name = tensor<string, []>("op_245_end_0"), val = tensor<int32, [4]>([1, 4, 1, 16])];
            tensor<bool, [4]> var_245_end_mask_0 = const()[name = tensor<string, []>("op_245_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_245_squeeze_mask_0 = const()[name = tensor<string, []>("op_245_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_245_cast_fp16 = slice_by_index(begin = var_245_begin_0, end = var_245_end_0, end_mask = var_245_end_mask_0, squeeze_mask = var_245_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_245_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_9_cast_fp16 = add(x = var_243_cast_fp16, y = var_245_cast_fp16)[name = tensor<string, []>("hidden_state_9_cast_fp16")];
            tensor<int32, [3]> var_248_begin_0 = const()[name = tensor<string, []>("op_248_begin_0"), val = tensor<int32, [3]>([0, 3, 0])];
            tensor<int32, [3]> var_248_end_0 = const()[name = tensor<string, []>("op_248_end_0"), val = tensor<int32, [3]>([1, 4, 16])];
            tensor<bool, [3]> var_248_end_mask_0 = const()[name = tensor<string, []>("op_248_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_248_squeeze_mask_0 = const()[name = tensor<string, []>("op_248_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_248_cast_fp16 = slice_by_index(begin = var_248_begin_0, end = var_248_end_0, end_mask = var_248_end_mask_0, squeeze_mask = var_248_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_248_cast_fp16")];
            tensor<int32, [3]> concat_28 = const()[name = tensor<string, []>("concat_28"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_10_cast_fp16 = reshape(shape = concat_28, x = var_248_cast_fp16)[name = tensor<string, []>("reshape_10_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = hidden_state_9_cast_fp16, y = reshape_10_cast_fp16)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, [2]> concat_31 = const()[name = tensor<string, []>("concat_31"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_11_cast_fp16 = reshape(shape = concat_31, x = matmul_3_cast_fp16)[name = tensor<string, []>("reshape_11_cast_fp16")];
            tensor<int32, [4]> var_253_begin_0 = const()[name = tensor<string, []>("op_253_begin_0"), val = tensor<int32, [4]>([0, 4, 0, 0])];
            tensor<int32, [4]> var_253_end_0 = const()[name = tensor<string, []>("op_253_end_0"), val = tensor<int32, [4]>([1, 5, 256, 16])];
            tensor<bool, [4]> var_253_end_mask_0 = const()[name = tensor<string, []>("op_253_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_253_squeeze_mask_0 = const()[name = tensor<string, []>("op_253_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_253_cast_fp16 = slice_by_index(begin = var_253_begin_0, end = var_253_end_0, end_mask = var_253_end_mask_0, squeeze_mask = var_253_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_253_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_254_cast_fp16 = mul(x = var_253_cast_fp16, y = hidden_state_9_cast_fp16)[name = tensor<string, []>("op_254_cast_fp16")];
            tensor<int32, [4]> var_256_begin_0 = const()[name = tensor<string, []>("op_256_begin_0"), val = tensor<int32, [4]>([0, 4, 0, 0])];
            tensor<int32, [4]> var_256_end_0 = const()[name = tensor<string, []>("op_256_end_0"), val = tensor<int32, [4]>([1, 5, 1, 16])];
            tensor<bool, [4]> var_256_end_mask_0 = const()[name = tensor<string, []>("op_256_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_256_squeeze_mask_0 = const()[name = tensor<string, []>("op_256_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_256_cast_fp16 = slice_by_index(begin = var_256_begin_0, end = var_256_end_0, end_mask = var_256_end_mask_0, squeeze_mask = var_256_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_11_cast_fp16 = add(x = var_254_cast_fp16, y = var_256_cast_fp16)[name = tensor<string, []>("hidden_state_11_cast_fp16")];
            tensor<int32, [3]> var_259_begin_0 = const()[name = tensor<string, []>("op_259_begin_0"), val = tensor<int32, [3]>([0, 4, 0])];
            tensor<int32, [3]> var_259_end_0 = const()[name = tensor<string, []>("op_259_end_0"), val = tensor<int32, [3]>([1, 5, 16])];
            tensor<bool, [3]> var_259_end_mask_0 = const()[name = tensor<string, []>("op_259_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_259_squeeze_mask_0 = const()[name = tensor<string, []>("op_259_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_259_cast_fp16 = slice_by_index(begin = var_259_begin_0, end = var_259_end_0, end_mask = var_259_end_mask_0, squeeze_mask = var_259_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_259_cast_fp16")];
            tensor<int32, [3]> concat_36 = const()[name = tensor<string, []>("concat_36"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_13_cast_fp16 = reshape(shape = concat_36, x = var_259_cast_fp16)[name = tensor<string, []>("reshape_13_cast_fp16")];
            tensor<bool, []> matmul_4_transpose_x_0 = const()[name = tensor<string, []>("matmul_4_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_4_transpose_y_0 = const()[name = tensor<string, []>("matmul_4_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_4_cast_fp16 = matmul(transpose_x = matmul_4_transpose_x_0, transpose_y = matmul_4_transpose_y_0, x = hidden_state_11_cast_fp16, y = reshape_13_cast_fp16)[name = tensor<string, []>("matmul_4_cast_fp16")];
            tensor<int32, [2]> concat_39 = const()[name = tensor<string, []>("concat_39"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_14_cast_fp16 = reshape(shape = concat_39, x = matmul_4_cast_fp16)[name = tensor<string, []>("reshape_14_cast_fp16")];
            tensor<int32, [4]> var_264_begin_0 = const()[name = tensor<string, []>("op_264_begin_0"), val = tensor<int32, [4]>([0, 5, 0, 0])];
            tensor<int32, [4]> var_264_end_0 = const()[name = tensor<string, []>("op_264_end_0"), val = tensor<int32, [4]>([1, 6, 256, 16])];
            tensor<bool, [4]> var_264_end_mask_0 = const()[name = tensor<string, []>("op_264_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_264_squeeze_mask_0 = const()[name = tensor<string, []>("op_264_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_264_cast_fp16 = slice_by_index(begin = var_264_begin_0, end = var_264_end_0, end_mask = var_264_end_mask_0, squeeze_mask = var_264_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_265_cast_fp16 = mul(x = var_264_cast_fp16, y = hidden_state_11_cast_fp16)[name = tensor<string, []>("op_265_cast_fp16")];
            tensor<int32, [4]> var_267_begin_0 = const()[name = tensor<string, []>("op_267_begin_0"), val = tensor<int32, [4]>([0, 5, 0, 0])];
            tensor<int32, [4]> var_267_end_0 = const()[name = tensor<string, []>("op_267_end_0"), val = tensor<int32, [4]>([1, 6, 1, 16])];
            tensor<bool, [4]> var_267_end_mask_0 = const()[name = tensor<string, []>("op_267_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_267_squeeze_mask_0 = const()[name = tensor<string, []>("op_267_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_267_cast_fp16 = slice_by_index(begin = var_267_begin_0, end = var_267_end_0, end_mask = var_267_end_mask_0, squeeze_mask = var_267_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_267_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_13_cast_fp16 = add(x = var_265_cast_fp16, y = var_267_cast_fp16)[name = tensor<string, []>("hidden_state_13_cast_fp16")];
            tensor<int32, [3]> var_270_begin_0 = const()[name = tensor<string, []>("op_270_begin_0"), val = tensor<int32, [3]>([0, 5, 0])];
            tensor<int32, [3]> var_270_end_0 = const()[name = tensor<string, []>("op_270_end_0"), val = tensor<int32, [3]>([1, 6, 16])];
            tensor<bool, [3]> var_270_end_mask_0 = const()[name = tensor<string, []>("op_270_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_270_squeeze_mask_0 = const()[name = tensor<string, []>("op_270_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_270_cast_fp16 = slice_by_index(begin = var_270_begin_0, end = var_270_end_0, end_mask = var_270_end_mask_0, squeeze_mask = var_270_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_270_cast_fp16")];
            tensor<int32, [3]> concat_44 = const()[name = tensor<string, []>("concat_44"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_16_cast_fp16 = reshape(shape = concat_44, x = var_270_cast_fp16)[name = tensor<string, []>("reshape_16_cast_fp16")];
            tensor<bool, []> matmul_5_transpose_x_0 = const()[name = tensor<string, []>("matmul_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_5_transpose_y_0 = const()[name = tensor<string, []>("matmul_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_5_cast_fp16 = matmul(transpose_x = matmul_5_transpose_x_0, transpose_y = matmul_5_transpose_y_0, x = hidden_state_13_cast_fp16, y = reshape_16_cast_fp16)[name = tensor<string, []>("matmul_5_cast_fp16")];
            tensor<int32, [2]> concat_47 = const()[name = tensor<string, []>("concat_47"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_17_cast_fp16 = reshape(shape = concat_47, x = matmul_5_cast_fp16)[name = tensor<string, []>("reshape_17_cast_fp16")];
            tensor<int32, [4]> var_275_begin_0 = const()[name = tensor<string, []>("op_275_begin_0"), val = tensor<int32, [4]>([0, 6, 0, 0])];
            tensor<int32, [4]> var_275_end_0 = const()[name = tensor<string, []>("op_275_end_0"), val = tensor<int32, [4]>([1, 7, 256, 16])];
            tensor<bool, [4]> var_275_end_mask_0 = const()[name = tensor<string, []>("op_275_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_275_squeeze_mask_0 = const()[name = tensor<string, []>("op_275_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_275_cast_fp16 = slice_by_index(begin = var_275_begin_0, end = var_275_end_0, end_mask = var_275_end_mask_0, squeeze_mask = var_275_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_275_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_276_cast_fp16 = mul(x = var_275_cast_fp16, y = hidden_state_13_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<int32, [4]> var_278_begin_0 = const()[name = tensor<string, []>("op_278_begin_0"), val = tensor<int32, [4]>([0, 6, 0, 0])];
            tensor<int32, [4]> var_278_end_0 = const()[name = tensor<string, []>("op_278_end_0"), val = tensor<int32, [4]>([1, 7, 1, 16])];
            tensor<bool, [4]> var_278_end_mask_0 = const()[name = tensor<string, []>("op_278_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_278_squeeze_mask_0 = const()[name = tensor<string, []>("op_278_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_278_cast_fp16 = slice_by_index(begin = var_278_begin_0, end = var_278_end_0, end_mask = var_278_end_mask_0, squeeze_mask = var_278_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_278_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_15_cast_fp16 = add(x = var_276_cast_fp16, y = var_278_cast_fp16)[name = tensor<string, []>("hidden_state_15_cast_fp16")];
            tensor<int32, [3]> var_281_begin_0 = const()[name = tensor<string, []>("op_281_begin_0"), val = tensor<int32, [3]>([0, 6, 0])];
            tensor<int32, [3]> var_281_end_0 = const()[name = tensor<string, []>("op_281_end_0"), val = tensor<int32, [3]>([1, 7, 16])];
            tensor<bool, [3]> var_281_end_mask_0 = const()[name = tensor<string, []>("op_281_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_281_squeeze_mask_0 = const()[name = tensor<string, []>("op_281_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_281_cast_fp16 = slice_by_index(begin = var_281_begin_0, end = var_281_end_0, end_mask = var_281_end_mask_0, squeeze_mask = var_281_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_281_cast_fp16")];
            tensor<int32, [3]> concat_52 = const()[name = tensor<string, []>("concat_52"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_19_cast_fp16 = reshape(shape = concat_52, x = var_281_cast_fp16)[name = tensor<string, []>("reshape_19_cast_fp16")];
            tensor<bool, []> matmul_6_transpose_x_0 = const()[name = tensor<string, []>("matmul_6_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_6_transpose_y_0 = const()[name = tensor<string, []>("matmul_6_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_6_cast_fp16 = matmul(transpose_x = matmul_6_transpose_x_0, transpose_y = matmul_6_transpose_y_0, x = hidden_state_15_cast_fp16, y = reshape_19_cast_fp16)[name = tensor<string, []>("matmul_6_cast_fp16")];
            tensor<int32, [2]> concat_55 = const()[name = tensor<string, []>("concat_55"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_20_cast_fp16 = reshape(shape = concat_55, x = matmul_6_cast_fp16)[name = tensor<string, []>("reshape_20_cast_fp16")];
            tensor<int32, [4]> var_286_begin_0 = const()[name = tensor<string, []>("op_286_begin_0"), val = tensor<int32, [4]>([0, 7, 0, 0])];
            tensor<int32, [4]> var_286_end_0 = const()[name = tensor<string, []>("op_286_end_0"), val = tensor<int32, [4]>([1, 8, 256, 16])];
            tensor<bool, [4]> var_286_end_mask_0 = const()[name = tensor<string, []>("op_286_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_286_squeeze_mask_0 = const()[name = tensor<string, []>("op_286_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_286_cast_fp16 = slice_by_index(begin = var_286_begin_0, end = var_286_end_0, end_mask = var_286_end_mask_0, squeeze_mask = var_286_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_286_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_287_cast_fp16 = mul(x = var_286_cast_fp16, y = hidden_state_15_cast_fp16)[name = tensor<string, []>("op_287_cast_fp16")];
            tensor<int32, [4]> var_289_begin_0 = const()[name = tensor<string, []>("op_289_begin_0"), val = tensor<int32, [4]>([0, 7, 0, 0])];
            tensor<int32, [4]> var_289_end_0 = const()[name = tensor<string, []>("op_289_end_0"), val = tensor<int32, [4]>([1, 8, 1, 16])];
            tensor<bool, [4]> var_289_end_mask_0 = const()[name = tensor<string, []>("op_289_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_289_squeeze_mask_0 = const()[name = tensor<string, []>("op_289_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_289_cast_fp16 = slice_by_index(begin = var_289_begin_0, end = var_289_end_0, end_mask = var_289_end_mask_0, squeeze_mask = var_289_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_289_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_17_cast_fp16 = add(x = var_287_cast_fp16, y = var_289_cast_fp16)[name = tensor<string, []>("hidden_state_17_cast_fp16")];
            tensor<int32, [3]> var_292_begin_0 = const()[name = tensor<string, []>("op_292_begin_0"), val = tensor<int32, [3]>([0, 7, 0])];
            tensor<int32, [3]> var_292_end_0 = const()[name = tensor<string, []>("op_292_end_0"), val = tensor<int32, [3]>([1, 8, 16])];
            tensor<bool, [3]> var_292_end_mask_0 = const()[name = tensor<string, []>("op_292_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_292_squeeze_mask_0 = const()[name = tensor<string, []>("op_292_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_292_cast_fp16 = slice_by_index(begin = var_292_begin_0, end = var_292_end_0, end_mask = var_292_end_mask_0, squeeze_mask = var_292_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<int32, [3]> concat_60 = const()[name = tensor<string, []>("concat_60"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_22_cast_fp16 = reshape(shape = concat_60, x = var_292_cast_fp16)[name = tensor<string, []>("reshape_22_cast_fp16")];
