program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 256, 80]> audio_chunk, tensor<fp16, [1, 1, 256]> predictor_hidden_in, tensor<fp16, [1, 1]> token_in) {
            tensor<int32, [3]> input_1_perm_0 = const()[name = tensor<string, []>("input_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [1]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 80, 5]> model_frontend_conv_network_0_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_0_weight_to_fp16"), val = tensor<fp16, [256, 80, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [256]> model_frontend_conv_network_0_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(204928)))];
            tensor<fp16, [1, 80, 256]> input_1_cast_fp16 = transpose(perm = input_1_perm_0, x = audio_chunk)[name = tensor<string, []>("transpose_528")];
            tensor<fp16, [1, 256, 128]> input_3_cast_fp16 = conv(bias = model_frontend_conv_network_0_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = model_frontend_conv_network_0_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_mode_0 = const()[name = tensor<string, []>("input_5_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 128]> input_5_cast_fp16 = gelu(mode = input_5_mode_0, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [1]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 5]> model_frontend_conv_network_2_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_2_weight_to_fp16"), val = tensor<fp16, [256, 256, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(205504)))];
            tensor<fp16, [256]> model_frontend_conv_network_2_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(860928)))];
            tensor<fp16, [1, 256, 64]> input_7_cast_fp16 = conv(bias = model_frontend_conv_network_2_bias_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = model_frontend_conv_network_2_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_mode_0 = const()[name = tensor<string, []>("input_9_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 64]> input_9_cast_fp16 = gelu(mode = input_9_mode_0, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 3]> model_frontend_conv_network_4_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_4_weight_to_fp16"), val = tensor<fp16, [256, 256, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(861504)))];
            tensor<fp16, [256]> model_frontend_conv_network_4_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_4_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1254784)))];
            tensor<fp16, [1, 256, 64]> input_11_cast_fp16 = conv(bias = model_frontend_conv_network_4_bias_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = model_frontend_conv_network_4_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> conv_output_mode_0 = const()[name = tensor<string, []>("conv_output_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 64]> conv_output_cast_fp16 = gelu(mode = conv_output_mode_0, x = input_11_cast_fp16)[name = tensor<string, []>("conv_output_cast_fp16")];
            tensor<int32, [3]> input_13_perm_0 = const()[name = tensor<string, []>("input_13_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_1_axes_0 = const()[name = tensor<string, []>("x_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> model_frontend_output_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_output_norm_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1255360)))];
            tensor<fp16, [256]> model_frontend_output_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_output_norm_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1255936)))];
            tensor<fp16, []> var_23_to_fp16 = const()[name = tensor<string, []>("op_23_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 64, 256]> input_13_cast_fp16 = transpose(perm = input_13_perm_0, x = conv_output_cast_fp16)[name = tensor<string, []>("transpose_527")];
            tensor<fp16, [1, 64, 256]> x_1_cast_fp16 = layer_norm(axes = x_1_axes_0, beta = model_frontend_output_norm_bias_to_fp16, epsilon = var_23_to_fp16, gamma = model_frontend_output_norm_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<fp32, []> var_77 = const()[name = tensor<string, []>("op_77"), val = tensor<fp32, []>(0x1.2a05f2p+33)];
            tensor<fp16, [256, 256]> model_encoder_blocks_0_in_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_in_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1256512)))];
            tensor<fp16, [256]> model_encoder_blocks_0_in_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_in_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1387648)))];
            tensor<fp16, [1, 64, 256]> linear_0_cast_fp16 = linear(bias = model_encoder_blocks_0_in_proj_bias_to_fp16, weight = model_encoder_blocks_0_in_proj_weight_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [256, 256]> model_encoder_blocks_0_z_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_z_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1388224)))];
            tensor<fp16, [256]> model_encoder_blocks_0_z_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_z_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1519360)))];
            tensor<fp16, [1, 64, 256]> linear_1_cast_fp16 = linear(bias = model_encoder_blocks_0_z_proj_bias_to_fp16, weight = model_encoder_blocks_0_z_proj_weight_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [3]> input_15_perm_0 = const()[name = tensor<string, []>("input_15_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> var_174_pad_type_0 = const()[name = tensor<string, []>("op_174_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> var_174_strides_0 = const()[name = tensor<string, []>("op_174_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> var_174_pad_0 = const()[name = tensor<string, []>("op_174_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> var_174_dilations_0 = const()[name = tensor<string, []>("op_174_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_174_groups_0 = const()[name = tensor<string, []>("op_174_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1]> model_encoder_blocks_0_B_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_B_conv_weight_to_fp16"), val = tensor<fp16, [16, 256, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1519936)))];
            tensor<fp16, [16]> model_encoder_blocks_0_B_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_B_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528192)))];
            tensor<fp16, [1, 256, 64]> input_15_cast_fp16 = transpose(perm = input_15_perm_0, x = linear_0_cast_fp16)[name = tensor<string, []>("transpose_526")];
            tensor<fp16, [1, 16, 64]> var_174_cast_fp16 = conv(bias = model_encoder_blocks_0_B_conv_bias_to_fp16, dilations = var_174_dilations_0, groups = var_174_groups_0, pad = var_174_pad_0, pad_type = var_174_pad_type_0, strides = var_174_strides_0, weight = model_encoder_blocks_0_B_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_174_cast_fp16")];
            tensor<int32, [3]> B_proj_1_perm_0 = const()[name = tensor<string, []>("B_proj_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> var_182_pad_type_0 = const()[name = tensor<string, []>("op_182_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> var_182_strides_0 = const()[name = tensor<string, []>("op_182_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> var_182_pad_0 = const()[name = tensor<string, []>("op_182_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> var_182_dilations_0 = const()[name = tensor<string, []>("op_182_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_182_groups_0 = const()[name = tensor<string, []>("op_182_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1]> model_encoder_blocks_0_C_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_C_conv_weight_to_fp16"), val = tensor<fp16, [16, 256, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528320)))];
            tensor<fp16, [16]> model_encoder_blocks_0_C_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_C_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536576)))];
            tensor<fp16, [1, 16, 64]> var_182_cast_fp16 = conv(bias = model_encoder_blocks_0_C_conv_bias_to_fp16, dilations = var_182_dilations_0, groups = var_182_groups_0, pad = var_182_pad_0, pad_type = var_182_pad_type_0, strides = var_182_strides_0, weight = model_encoder_blocks_0_C_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_182_cast_fp16")];
            tensor<int32, [3]> C_proj_1_perm_0 = const()[name = tensor<string, []>("C_proj_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1, 64, 256]> delta_positive_1_cast_fp16 = softplus(x = linear_0_cast_fp16)[name = tensor<string, []>("delta_positive_1_cast_fp16")];
            tensor<fp16, []> var_76_to_fp16 = const()[name = tensor<string, []>("op_76_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(inf)];
            tensor<fp16, [1, 64, 256]> clip_0_cast_fp16 = clip(alpha = var_76_to_fp16, beta = const_2_to_fp16, x = delta_positive_1_cast_fp16)[name = tensor<string, []>("clip_0_cast_fp16")];
            tensor<int32, [1]> var_189_axes_0 = const()[name = tensor<string, []>("op_189_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 64, 256, 1]> var_189_cast_fp16 = expand_dims(axes = var_189_axes_0, x = clip_0_cast_fp16)[name = tensor<string, []>("op_189_cast_fp16")];
            tensor<fp16, [1, 1, 256, 16]> var_193_to_fp16 = const()[name = tensor<string, []>("op_193_to_fp16"), val = tensor<fp16, [1, 1, 256, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536704)))];
            tensor<fp16, [1, 64, 256, 16]> var_194_cast_fp16 = mul(x = var_189_cast_fp16, y = var_193_to_fp16)[name = tensor<string, []>("op_194_cast_fp16")];
            tensor<fp16, [1, 64, 256, 16]> delta_A_1_cast_fp16 = exp(x = var_194_cast_fp16)[name = tensor<string, []>("delta_A_1_cast_fp16")];
            tensor<string, []> delta_A_1_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("delta_A_1_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp32, []> const_5 = const()[name = tensor<string, []>("const_5"), val = tensor<fp32, []>(-0x1.fffffep+127)];
            tensor<fp32, [1, 64, 256, 16]> delta_A_1_cast_fp16_to_fp32 = cast(dtype = delta_A_1_cast_fp16_to_fp32_dtype_0, x = delta_A_1_cast_fp16)[name = tensor<string, []>("cast_30")];
            tensor<fp32, [1, 64, 256, 16]> clip_1 = clip(alpha = const_5, beta = var_77, x = delta_A_1_cast_fp16_to_fp32)[name = tensor<string, []>("clip_1")];
            tensor<fp16, [1, 64, 256]> delta_u_1_cast_fp16 = mul(x = clip_0_cast_fp16, y = linear_0_cast_fp16)[name = tensor<string, []>("delta_u_1_cast_fp16")];
            tensor<int32, [1]> delta_u_scalar_1_axes_0 = const()[name = tensor<string, []>("delta_u_scalar_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, []> delta_u_scalar_1_keep_dims_0 = const()[name = tensor<string, []>("delta_u_scalar_1_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 64, 1]> delta_u_scalar_1_cast_fp16 = reduce_mean(axes = delta_u_scalar_1_axes_0, keep_dims = delta_u_scalar_1_keep_dims_0, x = delta_u_1_cast_fp16)[name = tensor<string, []>("delta_u_scalar_1_cast_fp16")];
            tensor<int32, [1]> var_200_axes_0 = const()[name = tensor<string, []>("op_200_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 64, 1, 1]> var_200_cast_fp16 = expand_dims(axes = var_200_axes_0, x = delta_u_scalar_1_cast_fp16)[name = tensor<string, []>("op_200_cast_fp16")];
            tensor<int32, [1]> var_201_axes_0 = const()[name = tensor<string, []>("op_201_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 16]> B_proj_1_cast_fp16 = transpose(perm = B_proj_1_perm_0, x = var_174_cast_fp16)[name = tensor<string, []>("transpose_525")];
            tensor<fp16, [1, 64, 1, 16]> var_201_cast_fp16 = expand_dims(axes = var_201_axes_0, x = B_proj_1_cast_fp16)[name = tensor<string, []>("op_201_cast_fp16")];
            tensor<fp16, [1, 64, 1, 16]> delta_B_u_1_cast_fp16 = mul(x = var_200_cast_fp16, y = var_201_cast_fp16)[name = tensor<string, []>("delta_B_u_1_cast_fp16")];
            tensor<int32, [4]> var_205_begin_0 = const()[name = tensor<string, []>("op_205_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_205_end_0 = const()[name = tensor<string, []>("op_205_end_0"), val = tensor<int32, [4]>([1, 1, 256, 16])];
            tensor<bool, [4]> var_205_end_mask_0 = const()[name = tensor<string, []>("op_205_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_205_squeeze_mask_0 = const()[name = tensor<string, []>("op_205_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<string, []> clip_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("clip_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 64, 256, 16]> clip_1_to_fp16 = cast(dtype = clip_1_to_fp16_dtype_0, x = clip_1)[name = tensor<string, []>("cast_29")];
            tensor<fp16, [1, 256, 16]> var_205_cast_fp16 = slice_by_index(begin = var_205_begin_0, end = var_205_end_0, end_mask = var_205_end_mask_0, squeeze_mask = var_205_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_205_cast_fp16")];
            tensor<fp16, [1, 256, 16]> h0_1_to_fp16 = const()[name = tensor<string, []>("h0_1_to_fp16"), val = tensor<fp16, [1, 256, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1544960)))];
            tensor<fp16, [1, 256, 16]> var_206_cast_fp16 = mul(x = var_205_cast_fp16, y = h0_1_to_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<int32, [4]> var_208_begin_0 = const()[name = tensor<string, []>("op_208_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_208_end_0 = const()[name = tensor<string, []>("op_208_end_0"), val = tensor<int32, [4]>([1, 1, 1, 16])];
            tensor<bool, [4]> var_208_end_mask_0 = const()[name = tensor<string, []>("op_208_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_208_squeeze_mask_0 = const()[name = tensor<string, []>("op_208_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_208_cast_fp16 = slice_by_index(begin = var_208_begin_0, end = var_208_end_0, end_mask = var_208_end_mask_0, squeeze_mask = var_208_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_208_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_3_cast_fp16 = add(x = var_206_cast_fp16, y = var_208_cast_fp16)[name = tensor<string, []>("hidden_state_3_cast_fp16")];
            tensor<int32, [3]> var_211_begin_0 = const()[name = tensor<string, []>("op_211_begin_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<int32, [3]> var_211_end_0 = const()[name = tensor<string, []>("op_211_end_0"), val = tensor<int32, [3]>([1, 1, 16])];
            tensor<bool, [3]> var_211_end_mask_0 = const()[name = tensor<string, []>("op_211_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_211_squeeze_mask_0 = const()[name = tensor<string, []>("op_211_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 64, 16]> C_proj_1_cast_fp16 = transpose(perm = C_proj_1_perm_0, x = var_182_cast_fp16)[name = tensor<string, []>("transpose_524")];
            tensor<fp16, [1, 16]> var_211_cast_fp16 = slice_by_index(begin = var_211_begin_0, end = var_211_end_0, end_mask = var_211_end_mask_0, squeeze_mask = var_211_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_211_cast_fp16")];
            tensor<int32, [3]> concat_4 = const()[name = tensor<string, []>("concat_4"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_1_cast_fp16 = reshape(shape = concat_4, x = var_211_cast_fp16)[name = tensor<string, []>("reshape_1_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = hidden_state_3_cast_fp16, y = reshape_1_cast_fp16)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, [2]> concat_7 = const()[name = tensor<string, []>("concat_7"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_2_cast_fp16 = reshape(shape = concat_7, x = matmul_0_cast_fp16)[name = tensor<string, []>("reshape_2_cast_fp16")];
            tensor<int32, [4]> var_216_begin_0 = const()[name = tensor<string, []>("op_216_begin_0"), val = tensor<int32, [4]>([0, 1, 0, 0])];
            tensor<int32, [4]> var_216_end_0 = const()[name = tensor<string, []>("op_216_end_0"), val = tensor<int32, [4]>([1, 2, 256, 16])];
            tensor<bool, [4]> var_216_end_mask_0 = const()[name = tensor<string, []>("op_216_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_216_squeeze_mask_0 = const()[name = tensor<string, []>("op_216_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_216_cast_fp16 = slice_by_index(begin = var_216_begin_0, end = var_216_end_0, end_mask = var_216_end_mask_0, squeeze_mask = var_216_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_216_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_217_cast_fp16 = mul(x = var_216_cast_fp16, y = hidden_state_3_cast_fp16)[name = tensor<string, []>("op_217_cast_fp16")];
            tensor<int32, [4]> var_219_begin_0 = const()[name = tensor<string, []>("op_219_begin_0"), val = tensor<int32, [4]>([0, 1, 0, 0])];
            tensor<int32, [4]> var_219_end_0 = const()[name = tensor<string, []>("op_219_end_0"), val = tensor<int32, [4]>([1, 2, 1, 16])];
            tensor<bool, [4]> var_219_end_mask_0 = const()[name = tensor<string, []>("op_219_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_219_squeeze_mask_0 = const()[name = tensor<string, []>("op_219_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_219_cast_fp16 = slice_by_index(begin = var_219_begin_0, end = var_219_end_0, end_mask = var_219_end_mask_0, squeeze_mask = var_219_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_5_cast_fp16 = add(x = var_217_cast_fp16, y = var_219_cast_fp16)[name = tensor<string, []>("hidden_state_5_cast_fp16")];
            tensor<int32, [3]> var_222_begin_0 = const()[name = tensor<string, []>("op_222_begin_0"), val = tensor<int32, [3]>([0, 1, 0])];
            tensor<int32, [3]> var_222_end_0 = const()[name = tensor<string, []>("op_222_end_0"), val = tensor<int32, [3]>([1, 2, 16])];
            tensor<bool, [3]> var_222_end_mask_0 = const()[name = tensor<string, []>("op_222_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_222_squeeze_mask_0 = const()[name = tensor<string, []>("op_222_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_222_cast_fp16 = slice_by_index(begin = var_222_begin_0, end = var_222_end_0, end_mask = var_222_end_mask_0, squeeze_mask = var_222_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_222_cast_fp16")];
            tensor<int32, [3]> concat_12 = const()[name = tensor<string, []>("concat_12"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_4_cast_fp16 = reshape(shape = concat_12, x = var_222_cast_fp16)[name = tensor<string, []>("reshape_4_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = hidden_state_5_cast_fp16, y = reshape_4_cast_fp16)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, [2]> concat_15 = const()[name = tensor<string, []>("concat_15"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_5_cast_fp16 = reshape(shape = concat_15, x = matmul_1_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<int32, [4]> var_227_begin_0 = const()[name = tensor<string, []>("op_227_begin_0"), val = tensor<int32, [4]>([0, 2, 0, 0])];
            tensor<int32, [4]> var_227_end_0 = const()[name = tensor<string, []>("op_227_end_0"), val = tensor<int32, [4]>([1, 3, 256, 16])];
            tensor<bool, [4]> var_227_end_mask_0 = const()[name = tensor<string, []>("op_227_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_227_squeeze_mask_0 = const()[name = tensor<string, []>("op_227_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_227_cast_fp16 = slice_by_index(begin = var_227_begin_0, end = var_227_end_0, end_mask = var_227_end_mask_0, squeeze_mask = var_227_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_227_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_228_cast_fp16 = mul(x = var_227_cast_fp16, y = hidden_state_5_cast_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<int32, [4]> var_230_begin_0 = const()[name = tensor<string, []>("op_230_begin_0"), val = tensor<int32, [4]>([0, 2, 0, 0])];
            tensor<int32, [4]> var_230_end_0 = const()[name = tensor<string, []>("op_230_end_0"), val = tensor<int32, [4]>([1, 3, 1, 16])];
            tensor<bool, [4]> var_230_end_mask_0 = const()[name = tensor<string, []>("op_230_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_230_squeeze_mask_0 = const()[name = tensor<string, []>("op_230_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_230_cast_fp16 = slice_by_index(begin = var_230_begin_0, end = var_230_end_0, end_mask = var_230_end_mask_0, squeeze_mask = var_230_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_230_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_7_cast_fp16 = add(x = var_228_cast_fp16, y = var_230_cast_fp16)[name = tensor<string, []>("hidden_state_7_cast_fp16")];
            tensor<int32, [3]> var_233_begin_0 = const()[name = tensor<string, []>("op_233_begin_0"), val = tensor<int32, [3]>([0, 2, 0])];
            tensor<int32, [3]> var_233_end_0 = const()[name = tensor<string, []>("op_233_end_0"), val = tensor<int32, [3]>([1, 3, 16])];
            tensor<bool, [3]> var_233_end_mask_0 = const()[name = tensor<string, []>("op_233_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_233_squeeze_mask_0 = const()[name = tensor<string, []>("op_233_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_233_cast_fp16 = slice_by_index(begin = var_233_begin_0, end = var_233_end_0, end_mask = var_233_end_mask_0, squeeze_mask = var_233_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<int32, [3]> concat_20 = const()[name = tensor<string, []>("concat_20"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_7_cast_fp16 = reshape(shape = concat_20, x = var_233_cast_fp16)[name = tensor<string, []>("reshape_7_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = hidden_state_7_cast_fp16, y = reshape_7_cast_fp16)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, [2]> concat_23 = const()[name = tensor<string, []>("concat_23"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_8_cast_fp16 = reshape(shape = concat_23, x = matmul_2_cast_fp16)[name = tensor<string, []>("reshape_8_cast_fp16")];
            tensor<int32, [4]> var_238_begin_0 = const()[name = tensor<string, []>("op_238_begin_0"), val = tensor<int32, [4]>([0, 3, 0, 0])];
            tensor<int32, [4]> var_238_end_0 = const()[name = tensor<string, []>("op_238_end_0"), val = tensor<int32, [4]>([1, 4, 256, 16])];
            tensor<bool, [4]> var_238_end_mask_0 = const()[name = tensor<string, []>("op_238_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_238_squeeze_mask_0 = const()[name = tensor<string, []>("op_238_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_238_cast_fp16 = slice_by_index(begin = var_238_begin_0, end = var_238_end_0, end_mask = var_238_end_mask_0, squeeze_mask = var_238_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_238_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_239_cast_fp16 = mul(x = var_238_cast_fp16, y = hidden_state_7_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<int32, [4]> var_241_begin_0 = const()[name = tensor<string, []>("op_241_begin_0"), val = tensor<int32, [4]>([0, 3, 0, 0])];
            tensor<int32, [4]> var_241_end_0 = const()[name = tensor<string, []>("op_241_end_0"), val = tensor<int32, [4]>([1, 4, 1, 16])];
            tensor<bool, [4]> var_241_end_mask_0 = const()[name = tensor<string, []>("op_241_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_241_squeeze_mask_0 = const()[name = tensor<string, []>("op_241_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_241_cast_fp16 = slice_by_index(begin = var_241_begin_0, end = var_241_end_0, end_mask = var_241_end_mask_0, squeeze_mask = var_241_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_241_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_9_cast_fp16 = add(x = var_239_cast_fp16, y = var_241_cast_fp16)[name = tensor<string, []>("hidden_state_9_cast_fp16")];
            tensor<int32, [3]> var_244_begin_0 = const()[name = tensor<string, []>("op_244_begin_0"), val = tensor<int32, [3]>([0, 3, 0])];
            tensor<int32, [3]> var_244_end_0 = const()[name = tensor<string, []>("op_244_end_0"), val = tensor<int32, [3]>([1, 4, 16])];
            tensor<bool, [3]> var_244_end_mask_0 = const()[name = tensor<string, []>("op_244_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_244_squeeze_mask_0 = const()[name = tensor<string, []>("op_244_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_244_cast_fp16 = slice_by_index(begin = var_244_begin_0, end = var_244_end_0, end_mask = var_244_end_mask_0, squeeze_mask = var_244_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_244_cast_fp16")];
            tensor<int32, [3]> concat_28 = const()[name = tensor<string, []>("concat_28"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_10_cast_fp16 = reshape(shape = concat_28, x = var_244_cast_fp16)[name = tensor<string, []>("reshape_10_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = hidden_state_9_cast_fp16, y = reshape_10_cast_fp16)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, [2]> concat_31 = const()[name = tensor<string, []>("concat_31"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_11_cast_fp16 = reshape(shape = concat_31, x = matmul_3_cast_fp16)[name = tensor<string, []>("reshape_11_cast_fp16")];
            tensor<int32, [4]> var_249_begin_0 = const()[name = tensor<string, []>("op_249_begin_0"), val = tensor<int32, [4]>([0, 4, 0, 0])];
            tensor<int32, [4]> var_249_end_0 = const()[name = tensor<string, []>("op_249_end_0"), val = tensor<int32, [4]>([1, 5, 256, 16])];
            tensor<bool, [4]> var_249_end_mask_0 = const()[name = tensor<string, []>("op_249_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_249_squeeze_mask_0 = const()[name = tensor<string, []>("op_249_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_249_cast_fp16 = slice_by_index(begin = var_249_begin_0, end = var_249_end_0, end_mask = var_249_end_mask_0, squeeze_mask = var_249_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_249_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_250_cast_fp16 = mul(x = var_249_cast_fp16, y = hidden_state_9_cast_fp16)[name = tensor<string, []>("op_250_cast_fp16")];
            tensor<int32, [4]> var_252_begin_0 = const()[name = tensor<string, []>("op_252_begin_0"), val = tensor<int32, [4]>([0, 4, 0, 0])];
            tensor<int32, [4]> var_252_end_0 = const()[name = tensor<string, []>("op_252_end_0"), val = tensor<int32, [4]>([1, 5, 1, 16])];
            tensor<bool, [4]> var_252_end_mask_0 = const()[name = tensor<string, []>("op_252_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_252_squeeze_mask_0 = const()[name = tensor<string, []>("op_252_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_252_cast_fp16 = slice_by_index(begin = var_252_begin_0, end = var_252_end_0, end_mask = var_252_end_mask_0, squeeze_mask = var_252_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_11_cast_fp16 = add(x = var_250_cast_fp16, y = var_252_cast_fp16)[name = tensor<string, []>("hidden_state_11_cast_fp16")];
            tensor<int32, [3]> var_255_begin_0 = const()[name = tensor<string, []>("op_255_begin_0"), val = tensor<int32, [3]>([0, 4, 0])];
            tensor<int32, [3]> var_255_end_0 = const()[name = tensor<string, []>("op_255_end_0"), val = tensor<int32, [3]>([1, 5, 16])];
            tensor<bool, [3]> var_255_end_mask_0 = const()[name = tensor<string, []>("op_255_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_255_squeeze_mask_0 = const()[name = tensor<string, []>("op_255_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_255_cast_fp16 = slice_by_index(begin = var_255_begin_0, end = var_255_end_0, end_mask = var_255_end_mask_0, squeeze_mask = var_255_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_255_cast_fp16")];
            tensor<int32, [3]> concat_36 = const()[name = tensor<string, []>("concat_36"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_13_cast_fp16 = reshape(shape = concat_36, x = var_255_cast_fp16)[name = tensor<string, []>("reshape_13_cast_fp16")];
            tensor<bool, []> matmul_4_transpose_x_0 = const()[name = tensor<string, []>("matmul_4_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_4_transpose_y_0 = const()[name = tensor<string, []>("matmul_4_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_4_cast_fp16 = matmul(transpose_x = matmul_4_transpose_x_0, transpose_y = matmul_4_transpose_y_0, x = hidden_state_11_cast_fp16, y = reshape_13_cast_fp16)[name = tensor<string, []>("matmul_4_cast_fp16")];
            tensor<int32, [2]> concat_39 = const()[name = tensor<string, []>("concat_39"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_14_cast_fp16 = reshape(shape = concat_39, x = matmul_4_cast_fp16)[name = tensor<string, []>("reshape_14_cast_fp16")];
            tensor<int32, [4]> var_260_begin_0 = const()[name = tensor<string, []>("op_260_begin_0"), val = tensor<int32, [4]>([0, 5, 0, 0])];
            tensor<int32, [4]> var_260_end_0 = const()[name = tensor<string, []>("op_260_end_0"), val = tensor<int32, [4]>([1, 6, 256, 16])];
            tensor<bool, [4]> var_260_end_mask_0 = const()[name = tensor<string, []>("op_260_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_260_squeeze_mask_0 = const()[name = tensor<string, []>("op_260_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_260_cast_fp16 = slice_by_index(begin = var_260_begin_0, end = var_260_end_0, end_mask = var_260_end_mask_0, squeeze_mask = var_260_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_260_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_261_cast_fp16 = mul(x = var_260_cast_fp16, y = hidden_state_11_cast_fp16)[name = tensor<string, []>("op_261_cast_fp16")];
            tensor<int32, [4]> var_263_begin_0 = const()[name = tensor<string, []>("op_263_begin_0"), val = tensor<int32, [4]>([0, 5, 0, 0])];
            tensor<int32, [4]> var_263_end_0 = const()[name = tensor<string, []>("op_263_end_0"), val = tensor<int32, [4]>([1, 6, 1, 16])];
            tensor<bool, [4]> var_263_end_mask_0 = const()[name = tensor<string, []>("op_263_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_263_squeeze_mask_0 = const()[name = tensor<string, []>("op_263_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_263_cast_fp16 = slice_by_index(begin = var_263_begin_0, end = var_263_end_0, end_mask = var_263_end_mask_0, squeeze_mask = var_263_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_263_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_13_cast_fp16 = add(x = var_261_cast_fp16, y = var_263_cast_fp16)[name = tensor<string, []>("hidden_state_13_cast_fp16")];
            tensor<int32, [3]> var_266_begin_0 = const()[name = tensor<string, []>("op_266_begin_0"), val = tensor<int32, [3]>([0, 5, 0])];
            tensor<int32, [3]> var_266_end_0 = const()[name = tensor<string, []>("op_266_end_0"), val = tensor<int32, [3]>([1, 6, 16])];
            tensor<bool, [3]> var_266_end_mask_0 = const()[name = tensor<string, []>("op_266_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_266_squeeze_mask_0 = const()[name = tensor<string, []>("op_266_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_266_cast_fp16 = slice_by_index(begin = var_266_begin_0, end = var_266_end_0, end_mask = var_266_end_mask_0, squeeze_mask = var_266_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_266_cast_fp16")];
            tensor<int32, [3]> concat_44 = const()[name = tensor<string, []>("concat_44"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_16_cast_fp16 = reshape(shape = concat_44, x = var_266_cast_fp16)[name = tensor<string, []>("reshape_16_cast_fp16")];
            tensor<bool, []> matmul_5_transpose_x_0 = const()[name = tensor<string, []>("matmul_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_5_transpose_y_0 = const()[name = tensor<string, []>("matmul_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_5_cast_fp16 = matmul(transpose_x = matmul_5_transpose_x_0, transpose_y = matmul_5_transpose_y_0, x = hidden_state_13_cast_fp16, y = reshape_16_cast_fp16)[name = tensor<string, []>("matmul_5_cast_fp16")];
            tensor<int32, [2]> concat_47 = const()[name = tensor<string, []>("concat_47"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_17_cast_fp16 = reshape(shape = concat_47, x = matmul_5_cast_fp16)[name = tensor<string, []>("reshape_17_cast_fp16")];
            tensor<int32, [4]> var_271_begin_0 = const()[name = tensor<string, []>("op_271_begin_0"), val = tensor<int32, [4]>([0, 6, 0, 0])];
            tensor<int32, [4]> var_271_end_0 = const()[name = tensor<string, []>("op_271_end_0"), val = tensor<int32, [4]>([1, 7, 256, 16])];
            tensor<bool, [4]> var_271_end_mask_0 = const()[name = tensor<string, []>("op_271_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_271_squeeze_mask_0 = const()[name = tensor<string, []>("op_271_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_271_cast_fp16 = slice_by_index(begin = var_271_begin_0, end = var_271_end_0, end_mask = var_271_end_mask_0, squeeze_mask = var_271_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_271_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_272_cast_fp16 = mul(x = var_271_cast_fp16, y = hidden_state_13_cast_fp16)[name = tensor<string, []>("op_272_cast_fp16")];
            tensor<int32, [4]> var_274_begin_0 = const()[name = tensor<string, []>("op_274_begin_0"), val = tensor<int32, [4]>([0, 6, 0, 0])];
            tensor<int32, [4]> var_274_end_0 = const()[name = tensor<string, []>("op_274_end_0"), val = tensor<int32, [4]>([1, 7, 1, 16])];
            tensor<bool, [4]> var_274_end_mask_0 = const()[name = tensor<string, []>("op_274_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_274_squeeze_mask_0 = const()[name = tensor<string, []>("op_274_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_274_cast_fp16 = slice_by_index(begin = var_274_begin_0, end = var_274_end_0, end_mask = var_274_end_mask_0, squeeze_mask = var_274_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_274_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_15_cast_fp16 = add(x = var_272_cast_fp16, y = var_274_cast_fp16)[name = tensor<string, []>("hidden_state_15_cast_fp16")];
            tensor<int32, [3]> var_277_begin_0 = const()[name = tensor<string, []>("op_277_begin_0"), val = tensor<int32, [3]>([0, 6, 0])];
            tensor<int32, [3]> var_277_end_0 = const()[name = tensor<string, []>("op_277_end_0"), val = tensor<int32, [3]>([1, 7, 16])];
            tensor<bool, [3]> var_277_end_mask_0 = const()[name = tensor<string, []>("op_277_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_277_squeeze_mask_0 = const()[name = tensor<string, []>("op_277_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_277_cast_fp16 = slice_by_index(begin = var_277_begin_0, end = var_277_end_0, end_mask = var_277_end_mask_0, squeeze_mask = var_277_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_277_cast_fp16")];
            tensor<int32, [3]> concat_52 = const()[name = tensor<string, []>("concat_52"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_19_cast_fp16 = reshape(shape = concat_52, x = var_277_cast_fp16)[name = tensor<string, []>("reshape_19_cast_fp16")];
            tensor<bool, []> matmul_6_transpose_x_0 = const()[name = tensor<string, []>("matmul_6_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> matmul_6_transpose_y_0 = const()[name = tensor<string, []>("matmul_6_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> matmul_6_cast_fp16 = matmul(transpose_x = matmul_6_transpose_x_0, transpose_y = matmul_6_transpose_y_0, x = hidden_state_15_cast_fp16, y = reshape_19_cast_fp16)[name = tensor<string, []>("matmul_6_cast_fp16")];
            tensor<int32, [2]> concat_55 = const()[name = tensor<string, []>("concat_55"), val = tensor<int32, [2]>([1, 256])];
            tensor<fp16, [1, 256]> reshape_20_cast_fp16 = reshape(shape = concat_55, x = matmul_6_cast_fp16)[name = tensor<string, []>("reshape_20_cast_fp16")];
            tensor<int32, [4]> var_282_begin_0 = const()[name = tensor<string, []>("op_282_begin_0"), val = tensor<int32, [4]>([0, 7, 0, 0])];
            tensor<int32, [4]> var_282_end_0 = const()[name = tensor<string, []>("op_282_end_0"), val = tensor<int32, [4]>([1, 8, 256, 16])];
            tensor<bool, [4]> var_282_end_mask_0 = const()[name = tensor<string, []>("op_282_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_282_squeeze_mask_0 = const()[name = tensor<string, []>("op_282_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_282_cast_fp16 = slice_by_index(begin = var_282_begin_0, end = var_282_end_0, end_mask = var_282_end_mask_0, squeeze_mask = var_282_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_282_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_283_cast_fp16 = mul(x = var_282_cast_fp16, y = hidden_state_15_cast_fp16)[name = tensor<string, []>("op_283_cast_fp16")];
            tensor<int32, [4]> var_285_begin_0 = const()[name = tensor<string, []>("op_285_begin_0"), val = tensor<int32, [4]>([0, 7, 0, 0])];
            tensor<int32, [4]> var_285_end_0 = const()[name = tensor<string, []>("op_285_end_0"), val = tensor<int32, [4]>([1, 8, 1, 16])];
            tensor<bool, [4]> var_285_end_mask_0 = const()[name = tensor<string, []>("op_285_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_285_squeeze_mask_0 = const()[name = tensor<string, []>("op_285_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_285_cast_fp16 = slice_by_index(begin = var_285_begin_0, end = var_285_end_0, end_mask = var_285_end_mask_0, squeeze_mask = var_285_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_285_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_17_cast_fp16 = add(x = var_283_cast_fp16, y = var_285_cast_fp16)[name = tensor<string, []>("hidden_state_17_cast_fp16")];
            tensor<int32, [3]> var_288_begin_0 = const()[name = tensor<string, []>("op_288_begin_0"), val = tensor<int32, [3]>([0, 7, 0])];
            tensor<int32, [3]> var_288_end_0 = const()[name = tensor<string, []>("op_288_end_0"), val = tensor<int32, [3]>([1, 8, 16])];
            tensor<bool, [3]> var_288_end_mask_0 = const()[name = tensor<string, []>("op_288_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_288_squeeze_mask_0 = const()[name = tensor<string, []>("op_288_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_288_cast_fp16 = slice_by_index(begin = var_288_begin_0, end = var_288_end_0, end_mask = var_288_end_mask_0, squeeze_mask = var_288_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_288_cast_fp16")];
            tensor<int32, [3]> concat_60 = const()[name = tensor<string, []>("concat_60"), val = tensor<int32, [3]>([1, 16, 1])];
            tensor<fp16, [1, 16, 1]> reshape_22_cast_fp16 = reshape(shape = concat_60, x = var_288_cast_fp16)[name = tensor<string, []>("reshape_22_cast_fp16")];
