program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 256, 80]> audio_chunk, tensor<fp16, [1, 1, 256]> predictor_hidden_in, tensor<fp16, [1, 1]> token_in) {
            tensor<int32, [3]> input_1_perm_0 = const()[name = tensor<string, []>("input_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [1]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 80, 5]> model_frontend_conv_network_0_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_0_weight_to_fp16"), val = tensor<fp16, [256, 80, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [256]> model_frontend_conv_network_0_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(204928)))];
            tensor<fp16, [1, 80, 256]> input_1_cast_fp16 = transpose(perm = input_1_perm_0, x = audio_chunk)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [1, 256, 128]> input_3_cast_fp16 = conv(bias = model_frontend_conv_network_0_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = model_frontend_conv_network_0_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_mode_0 = const()[name = tensor<string, []>("input_5_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 128]> input_5_cast_fp16 = gelu(mode = input_5_mode_0, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [1]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 5]> model_frontend_conv_network_2_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_2_weight_to_fp16"), val = tensor<fp16, [256, 256, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(205504)))];
            tensor<fp16, [256]> model_frontend_conv_network_2_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(860928)))];
            tensor<fp16, [1, 256, 64]> input_7_cast_fp16 = conv(bias = model_frontend_conv_network_2_bias_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = model_frontend_conv_network_2_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_mode_0 = const()[name = tensor<string, []>("input_9_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 64]> input_9_cast_fp16 = gelu(mode = input_9_mode_0, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 3]> model_frontend_conv_network_4_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_4_weight_to_fp16"), val = tensor<fp16, [256, 256, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(861504)))];
            tensor<fp16, [256]> model_frontend_conv_network_4_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_conv_network_4_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1254784)))];
            tensor<fp16, [1, 256, 64]> input_11_cast_fp16 = conv(bias = model_frontend_conv_network_4_bias_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = model_frontend_conv_network_4_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> conv_output_mode_0 = const()[name = tensor<string, []>("conv_output_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 64]> conv_output_cast_fp16 = gelu(mode = conv_output_mode_0, x = input_11_cast_fp16)[name = tensor<string, []>("conv_output_cast_fp16")];
            tensor<int32, [3]> input_13_perm_0 = const()[name = tensor<string, []>("input_13_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_1_axes_0 = const()[name = tensor<string, []>("x_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> model_frontend_output_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_frontend_output_norm_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1255360)))];
            tensor<fp16, [256]> model_frontend_output_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_frontend_output_norm_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1255936)))];
            tensor<fp16, []> var_23_to_fp16 = const()[name = tensor<string, []>("op_23_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 64, 256]> input_13_cast_fp16 = transpose(perm = input_13_perm_0, x = conv_output_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [1, 64, 256]> x_1_cast_fp16 = layer_norm(axes = x_1_axes_0, beta = model_frontend_output_norm_bias_to_fp16, epsilon = var_23_to_fp16, gamma = model_frontend_output_norm_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<fp32, []> var_77 = const()[name = tensor<string, []>("op_77"), val = tensor<fp32, []>(0x1.2a05f2p+33)];
            tensor<fp16, [256, 256]> model_encoder_blocks_0_in_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_in_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1256512)))];
            tensor<fp16, [256]> model_encoder_blocks_0_in_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_in_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1387648)))];
            tensor<fp16, [1, 64, 256]> linear_0_cast_fp16 = linear(bias = model_encoder_blocks_0_in_proj_bias_to_fp16, weight = model_encoder_blocks_0_in_proj_weight_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [256, 256]> model_encoder_blocks_0_z_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_z_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1388224)))];
            tensor<fp16, [256]> model_encoder_blocks_0_z_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_z_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1519360)))];
            tensor<fp16, [1, 64, 256]> linear_1_cast_fp16 = linear(bias = model_encoder_blocks_0_z_proj_bias_to_fp16, weight = model_encoder_blocks_0_z_proj_weight_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [3]> input_15_perm_0 = const()[name = tensor<string, []>("input_15_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> var_177_pad_type_0 = const()[name = tensor<string, []>("op_177_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> var_177_strides_0 = const()[name = tensor<string, []>("op_177_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> var_177_pad_0 = const()[name = tensor<string, []>("op_177_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> var_177_dilations_0 = const()[name = tensor<string, []>("op_177_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_177_groups_0 = const()[name = tensor<string, []>("op_177_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1]> model_encoder_blocks_0_B_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_B_conv_weight_to_fp16"), val = tensor<fp16, [16, 256, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1519936)))];
            tensor<fp16, [16]> model_encoder_blocks_0_B_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_B_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528192)))];
            tensor<fp16, [1, 256, 64]> input_15_cast_fp16 = transpose(perm = input_15_perm_0, x = linear_0_cast_fp16)[name = tensor<string, []>("transpose_20")];
            tensor<fp16, [1, 16, 64]> var_177_cast_fp16 = conv(bias = model_encoder_blocks_0_B_conv_bias_to_fp16, dilations = var_177_dilations_0, groups = var_177_groups_0, pad = var_177_pad_0, pad_type = var_177_pad_type_0, strides = var_177_strides_0, weight = model_encoder_blocks_0_B_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_177_cast_fp16")];
            tensor<int32, [3]> B_proj_1_perm_0 = const()[name = tensor<string, []>("B_proj_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> var_185_pad_type_0 = const()[name = tensor<string, []>("op_185_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> var_185_strides_0 = const()[name = tensor<string, []>("op_185_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> var_185_pad_0 = const()[name = tensor<string, []>("op_185_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> var_185_dilations_0 = const()[name = tensor<string, []>("op_185_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_185_groups_0 = const()[name = tensor<string, []>("op_185_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1]> model_encoder_blocks_0_C_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_C_conv_weight_to_fp16"), val = tensor<fp16, [16, 256, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528320)))];
            tensor<fp16, [16]> model_encoder_blocks_0_C_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_encoder_blocks_0_C_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536576)))];
            tensor<fp16, [1, 16, 64]> var_185_cast_fp16 = conv(bias = model_encoder_blocks_0_C_conv_bias_to_fp16, dilations = var_185_dilations_0, groups = var_185_groups_0, pad = var_185_pad_0, pad_type = var_185_pad_type_0, strides = var_185_strides_0, weight = model_encoder_blocks_0_C_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_185_cast_fp16")];
            tensor<int32, [3]> C_proj_1_perm_0 = const()[name = tensor<string, []>("C_proj_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1, 64, 256]> delta_positive_1_cast_fp16 = softplus(x = linear_0_cast_fp16)[name = tensor<string, []>("delta_positive_1_cast_fp16")];
            tensor<fp16, []> var_76_to_fp16 = const()[name = tensor<string, []>("op_76_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(inf)];
            tensor<fp16, [1, 64, 256]> clip_0_cast_fp16 = clip(alpha = var_76_to_fp16, beta = const_2_to_fp16, x = delta_positive_1_cast_fp16)[name = tensor<string, []>("clip_0_cast_fp16")];
            tensor<int32, [1]> var_192_axes_0 = const()[name = tensor<string, []>("op_192_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 64, 256, 1]> var_192_cast_fp16 = expand_dims(axes = var_192_axes_0, x = clip_0_cast_fp16)[name = tensor<string, []>("op_192_cast_fp16")];
            tensor<fp16, [1, 1, 256, 16]> var_196_to_fp16 = const()[name = tensor<string, []>("op_196_to_fp16"), val = tensor<fp16, [1, 1, 256, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536704)))];
            tensor<fp16, [1, 64, 256, 16]> var_197_cast_fp16 = mul(x = var_192_cast_fp16, y = var_196_to_fp16)[name = tensor<string, []>("op_197_cast_fp16")];
            tensor<fp16, [1, 64, 256, 16]> delta_A_1_cast_fp16 = exp(x = var_197_cast_fp16)[name = tensor<string, []>("delta_A_1_cast_fp16")];
            tensor<string, []> delta_A_1_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("delta_A_1_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp32, []> const_5 = const()[name = tensor<string, []>("const_5"), val = tensor<fp32, []>(-0x1.fffffep+127)];
            tensor<fp32, [1, 64, 256, 16]> delta_A_1_cast_fp16_to_fp32 = cast(dtype = delta_A_1_cast_fp16_to_fp32_dtype_0, x = delta_A_1_cast_fp16)[name = tensor<string, []>("cast_40")];
            tensor<fp32, [1, 64, 256, 16]> clip_1 = clip(alpha = const_5, beta = var_77, x = delta_A_1_cast_fp16_to_fp32)[name = tensor<string, []>("clip_1")];
            tensor<fp16, [1, 64, 256]> delta_u_1_cast_fp16 = mul(x = clip_0_cast_fp16, y = linear_0_cast_fp16)[name = tensor<string, []>("delta_u_1_cast_fp16")];
            tensor<int32, [1]> delta_u_scalar_1_axes_0 = const()[name = tensor<string, []>("delta_u_scalar_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, []> delta_u_scalar_1_keep_dims_0 = const()[name = tensor<string, []>("delta_u_scalar_1_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 64, 1]> delta_u_scalar_1_cast_fp16 = reduce_mean(axes = delta_u_scalar_1_axes_0, keep_dims = delta_u_scalar_1_keep_dims_0, x = delta_u_1_cast_fp16)[name = tensor<string, []>("delta_u_scalar_1_cast_fp16")];
            tensor<int32, [1]> var_203_axes_0 = const()[name = tensor<string, []>("op_203_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 64, 1, 1]> var_203_cast_fp16 = expand_dims(axes = var_203_axes_0, x = delta_u_scalar_1_cast_fp16)[name = tensor<string, []>("op_203_cast_fp16")];
            tensor<int32, [1]> var_204_axes_0 = const()[name = tensor<string, []>("op_204_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 64, 16]> B_proj_1_cast_fp16 = transpose(perm = B_proj_1_perm_0, x = var_177_cast_fp16)[name = tensor<string, []>("transpose_19")];
            tensor<fp16, [1, 64, 1, 16]> var_204_cast_fp16 = expand_dims(axes = var_204_axes_0, x = B_proj_1_cast_fp16)[name = tensor<string, []>("op_204_cast_fp16")];
            tensor<fp16, [1, 64, 1, 16]> delta_B_u_1_cast_fp16 = mul(x = var_203_cast_fp16, y = var_204_cast_fp16)[name = tensor<string, []>("delta_B_u_1_cast_fp16")];
            tensor<int32, [4]> var_208_begin_0 = const()[name = tensor<string, []>("op_208_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_208_end_0 = const()[name = tensor<string, []>("op_208_end_0"), val = tensor<int32, [4]>([1, 1, 256, 16])];
            tensor<bool, [4]> var_208_end_mask_0 = const()[name = tensor<string, []>("op_208_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_208_squeeze_mask_0 = const()[name = tensor<string, []>("op_208_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<string, []> clip_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("clip_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 64, 256, 16]> clip_1_to_fp16 = cast(dtype = clip_1_to_fp16_dtype_0, x = clip_1)[name = tensor<string, []>("cast_39")];
            tensor<fp16, [1, 256, 16]> var_208_cast_fp16 = slice_by_index(begin = var_208_begin_0, end = var_208_end_0, end_mask = var_208_end_mask_0, squeeze_mask = var_208_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_208_cast_fp16")];
            tensor<fp16, [1, 256, 16]> h0_1_to_fp16 = const()[name = tensor<string, []>("h0_1_to_fp16"), val = tensor<fp16, [1, 256, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1544960)))];
            tensor<fp16, [1, 256, 16]> var_209_cast_fp16 = mul(x = var_208_cast_fp16, y = h0_1_to_fp16)[name = tensor<string, []>("op_209_cast_fp16")];
            tensor<int32, [4]> var_211_begin_0 = const()[name = tensor<string, []>("op_211_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_211_end_0 = const()[name = tensor<string, []>("op_211_end_0"), val = tensor<int32, [4]>([1, 1, 1, 16])];
            tensor<bool, [4]> var_211_end_mask_0 = const()[name = tensor<string, []>("op_211_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_211_squeeze_mask_0 = const()[name = tensor<string, []>("op_211_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_211_cast_fp16 = slice_by_index(begin = var_211_begin_0, end = var_211_end_0, end_mask = var_211_end_mask_0, squeeze_mask = var_211_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_211_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_3_cast_fp16 = add(x = var_209_cast_fp16, y = var_211_cast_fp16)[name = tensor<string, []>("hidden_state_3_cast_fp16")];
            tensor<int32, [3]> var_214_begin_0 = const()[name = tensor<string, []>("op_214_begin_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<int32, [3]> var_214_end_0 = const()[name = tensor<string, []>("op_214_end_0"), val = tensor<int32, [3]>([1, 1, 16])];
            tensor<bool, [3]> var_214_end_mask_0 = const()[name = tensor<string, []>("op_214_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_214_squeeze_mask_0 = const()[name = tensor<string, []>("op_214_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 64, 16]> C_proj_1_cast_fp16 = transpose(perm = C_proj_1_perm_0, x = var_185_cast_fp16)[name = tensor<string, []>("transpose_18")];
            tensor<fp16, [1, 16]> var_214_cast_fp16 = slice_by_index(begin = var_214_begin_0, end = var_214_end_0, end_mask = var_214_end_mask_0, squeeze_mask = var_214_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<int32, [1]> var_216_axes_0 = const()[name = tensor<string, []>("op_216_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_216_cast_fp16 = expand_dims(axes = var_216_axes_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_216_cast_fp16")];
            tensor<bool, []> var_217_transpose_x_0 = const()[name = tensor<string, []>("op_217_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_217_transpose_y_0 = const()[name = tensor<string, []>("op_217_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> var_217_cast_fp16 = matmul(transpose_x = var_217_transpose_x_0, transpose_y = var_217_transpose_y_0, x = hidden_state_3_cast_fp16, y = var_216_cast_fp16)[name = tensor<string, []>("op_217_cast_fp16")];
            tensor<int32, [1]> var_218_axes_0 = const()[name = tensor<string, []>("op_218_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256]> var_218_cast_fp16 = squeeze(axes = var_218_axes_0, x = var_217_cast_fp16)[name = tensor<string, []>("op_218_cast_fp16")];
            tensor<int32, [4]> var_220_begin_0 = const()[name = tensor<string, []>("op_220_begin_0"), val = tensor<int32, [4]>([0, 1, 0, 0])];
            tensor<int32, [4]> var_220_end_0 = const()[name = tensor<string, []>("op_220_end_0"), val = tensor<int32, [4]>([1, 2, 256, 16])];
            tensor<bool, [4]> var_220_end_mask_0 = const()[name = tensor<string, []>("op_220_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_220_squeeze_mask_0 = const()[name = tensor<string, []>("op_220_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_220_cast_fp16 = slice_by_index(begin = var_220_begin_0, end = var_220_end_0, end_mask = var_220_end_mask_0, squeeze_mask = var_220_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_220_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_221_cast_fp16 = mul(x = var_220_cast_fp16, y = hidden_state_3_cast_fp16)[name = tensor<string, []>("op_221_cast_fp16")];
            tensor<int32, [4]> var_223_begin_0 = const()[name = tensor<string, []>("op_223_begin_0"), val = tensor<int32, [4]>([0, 1, 0, 0])];
            tensor<int32, [4]> var_223_end_0 = const()[name = tensor<string, []>("op_223_end_0"), val = tensor<int32, [4]>([1, 2, 1, 16])];
            tensor<bool, [4]> var_223_end_mask_0 = const()[name = tensor<string, []>("op_223_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_223_squeeze_mask_0 = const()[name = tensor<string, []>("op_223_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_223_cast_fp16 = slice_by_index(begin = var_223_begin_0, end = var_223_end_0, end_mask = var_223_end_mask_0, squeeze_mask = var_223_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_223_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_5_cast_fp16 = add(x = var_221_cast_fp16, y = var_223_cast_fp16)[name = tensor<string, []>("hidden_state_5_cast_fp16")];
            tensor<int32, [3]> var_226_begin_0 = const()[name = tensor<string, []>("op_226_begin_0"), val = tensor<int32, [3]>([0, 1, 0])];
            tensor<int32, [3]> var_226_end_0 = const()[name = tensor<string, []>("op_226_end_0"), val = tensor<int32, [3]>([1, 2, 16])];
            tensor<bool, [3]> var_226_end_mask_0 = const()[name = tensor<string, []>("op_226_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_226_squeeze_mask_0 = const()[name = tensor<string, []>("op_226_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_226_cast_fp16 = slice_by_index(begin = var_226_begin_0, end = var_226_end_0, end_mask = var_226_end_mask_0, squeeze_mask = var_226_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_226_cast_fp16")];
            tensor<int32, [1]> var_228_axes_0 = const()[name = tensor<string, []>("op_228_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_228_cast_fp16 = expand_dims(axes = var_228_axes_0, x = var_226_cast_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<bool, []> var_229_transpose_x_0 = const()[name = tensor<string, []>("op_229_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_229_transpose_y_0 = const()[name = tensor<string, []>("op_229_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> var_229_cast_fp16 = matmul(transpose_x = var_229_transpose_x_0, transpose_y = var_229_transpose_y_0, x = hidden_state_5_cast_fp16, y = var_228_cast_fp16)[name = tensor<string, []>("op_229_cast_fp16")];
            tensor<int32, [1]> var_230_axes_0 = const()[name = tensor<string, []>("op_230_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256]> var_230_cast_fp16 = squeeze(axes = var_230_axes_0, x = var_229_cast_fp16)[name = tensor<string, []>("op_230_cast_fp16")];
            tensor<int32, [4]> var_232_begin_0 = const()[name = tensor<string, []>("op_232_begin_0"), val = tensor<int32, [4]>([0, 2, 0, 0])];
            tensor<int32, [4]> var_232_end_0 = const()[name = tensor<string, []>("op_232_end_0"), val = tensor<int32, [4]>([1, 3, 256, 16])];
            tensor<bool, [4]> var_232_end_mask_0 = const()[name = tensor<string, []>("op_232_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_232_squeeze_mask_0 = const()[name = tensor<string, []>("op_232_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_232_cast_fp16 = slice_by_index(begin = var_232_begin_0, end = var_232_end_0, end_mask = var_232_end_mask_0, squeeze_mask = var_232_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_232_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_233_cast_fp16 = mul(x = var_232_cast_fp16, y = hidden_state_5_cast_fp16)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<int32, [4]> var_235_begin_0 = const()[name = tensor<string, []>("op_235_begin_0"), val = tensor<int32, [4]>([0, 2, 0, 0])];
            tensor<int32, [4]> var_235_end_0 = const()[name = tensor<string, []>("op_235_end_0"), val = tensor<int32, [4]>([1, 3, 1, 16])];
            tensor<bool, [4]> var_235_end_mask_0 = const()[name = tensor<string, []>("op_235_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_235_squeeze_mask_0 = const()[name = tensor<string, []>("op_235_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_235_cast_fp16 = slice_by_index(begin = var_235_begin_0, end = var_235_end_0, end_mask = var_235_end_mask_0, squeeze_mask = var_235_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_235_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_7_cast_fp16 = add(x = var_233_cast_fp16, y = var_235_cast_fp16)[name = tensor<string, []>("hidden_state_7_cast_fp16")];
            tensor<int32, [3]> var_238_begin_0 = const()[name = tensor<string, []>("op_238_begin_0"), val = tensor<int32, [3]>([0, 2, 0])];
            tensor<int32, [3]> var_238_end_0 = const()[name = tensor<string, []>("op_238_end_0"), val = tensor<int32, [3]>([1, 3, 16])];
            tensor<bool, [3]> var_238_end_mask_0 = const()[name = tensor<string, []>("op_238_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_238_squeeze_mask_0 = const()[name = tensor<string, []>("op_238_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_238_cast_fp16 = slice_by_index(begin = var_238_begin_0, end = var_238_end_0, end_mask = var_238_end_mask_0, squeeze_mask = var_238_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_238_cast_fp16")];
            tensor<int32, [1]> var_240_axes_0 = const()[name = tensor<string, []>("op_240_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_240_cast_fp16 = expand_dims(axes = var_240_axes_0, x = var_238_cast_fp16)[name = tensor<string, []>("op_240_cast_fp16")];
            tensor<bool, []> var_241_transpose_x_0 = const()[name = tensor<string, []>("op_241_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_241_transpose_y_0 = const()[name = tensor<string, []>("op_241_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> var_241_cast_fp16 = matmul(transpose_x = var_241_transpose_x_0, transpose_y = var_241_transpose_y_0, x = hidden_state_7_cast_fp16, y = var_240_cast_fp16)[name = tensor<string, []>("op_241_cast_fp16")];
            tensor<int32, [1]> var_242_axes_0 = const()[name = tensor<string, []>("op_242_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256]> var_242_cast_fp16 = squeeze(axes = var_242_axes_0, x = var_241_cast_fp16)[name = tensor<string, []>("op_242_cast_fp16")];
            tensor<int32, [4]> var_244_begin_0 = const()[name = tensor<string, []>("op_244_begin_0"), val = tensor<int32, [4]>([0, 3, 0, 0])];
            tensor<int32, [4]> var_244_end_0 = const()[name = tensor<string, []>("op_244_end_0"), val = tensor<int32, [4]>([1, 4, 256, 16])];
            tensor<bool, [4]> var_244_end_mask_0 = const()[name = tensor<string, []>("op_244_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_244_squeeze_mask_0 = const()[name = tensor<string, []>("op_244_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_244_cast_fp16 = slice_by_index(begin = var_244_begin_0, end = var_244_end_0, end_mask = var_244_end_mask_0, squeeze_mask = var_244_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_244_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_245_cast_fp16 = mul(x = var_244_cast_fp16, y = hidden_state_7_cast_fp16)[name = tensor<string, []>("op_245_cast_fp16")];
            tensor<int32, [4]> var_247_begin_0 = const()[name = tensor<string, []>("op_247_begin_0"), val = tensor<int32, [4]>([0, 3, 0, 0])];
            tensor<int32, [4]> var_247_end_0 = const()[name = tensor<string, []>("op_247_end_0"), val = tensor<int32, [4]>([1, 4, 1, 16])];
            tensor<bool, [4]> var_247_end_mask_0 = const()[name = tensor<string, []>("op_247_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_247_squeeze_mask_0 = const()[name = tensor<string, []>("op_247_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_247_cast_fp16 = slice_by_index(begin = var_247_begin_0, end = var_247_end_0, end_mask = var_247_end_mask_0, squeeze_mask = var_247_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_247_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_9_cast_fp16 = add(x = var_245_cast_fp16, y = var_247_cast_fp16)[name = tensor<string, []>("hidden_state_9_cast_fp16")];
            tensor<int32, [3]> var_250_begin_0 = const()[name = tensor<string, []>("op_250_begin_0"), val = tensor<int32, [3]>([0, 3, 0])];
            tensor<int32, [3]> var_250_end_0 = const()[name = tensor<string, []>("op_250_end_0"), val = tensor<int32, [3]>([1, 4, 16])];
            tensor<bool, [3]> var_250_end_mask_0 = const()[name = tensor<string, []>("op_250_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_250_squeeze_mask_0 = const()[name = tensor<string, []>("op_250_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_250_cast_fp16 = slice_by_index(begin = var_250_begin_0, end = var_250_end_0, end_mask = var_250_end_mask_0, squeeze_mask = var_250_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_250_cast_fp16")];
            tensor<int32, [1]> var_252_axes_0 = const()[name = tensor<string, []>("op_252_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_252_cast_fp16 = expand_dims(axes = var_252_axes_0, x = var_250_cast_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<bool, []> var_253_transpose_x_0 = const()[name = tensor<string, []>("op_253_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_253_transpose_y_0 = const()[name = tensor<string, []>("op_253_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> var_253_cast_fp16 = matmul(transpose_x = var_253_transpose_x_0, transpose_y = var_253_transpose_y_0, x = hidden_state_9_cast_fp16, y = var_252_cast_fp16)[name = tensor<string, []>("op_253_cast_fp16")];
            tensor<int32, [1]> var_254_axes_0 = const()[name = tensor<string, []>("op_254_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256]> var_254_cast_fp16 = squeeze(axes = var_254_axes_0, x = var_253_cast_fp16)[name = tensor<string, []>("op_254_cast_fp16")];
            tensor<int32, [4]> var_256_begin_0 = const()[name = tensor<string, []>("op_256_begin_0"), val = tensor<int32, [4]>([0, 4, 0, 0])];
            tensor<int32, [4]> var_256_end_0 = const()[name = tensor<string, []>("op_256_end_0"), val = tensor<int32, [4]>([1, 5, 256, 16])];
            tensor<bool, [4]> var_256_end_mask_0 = const()[name = tensor<string, []>("op_256_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_256_squeeze_mask_0 = const()[name = tensor<string, []>("op_256_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_256_cast_fp16 = slice_by_index(begin = var_256_begin_0, end = var_256_end_0, end_mask = var_256_end_mask_0, squeeze_mask = var_256_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_257_cast_fp16 = mul(x = var_256_cast_fp16, y = hidden_state_9_cast_fp16)[name = tensor<string, []>("op_257_cast_fp16")];
            tensor<int32, [4]> var_259_begin_0 = const()[name = tensor<string, []>("op_259_begin_0"), val = tensor<int32, [4]>([0, 4, 0, 0])];
            tensor<int32, [4]> var_259_end_0 = const()[name = tensor<string, []>("op_259_end_0"), val = tensor<int32, [4]>([1, 5, 1, 16])];
            tensor<bool, [4]> var_259_end_mask_0 = const()[name = tensor<string, []>("op_259_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_259_squeeze_mask_0 = const()[name = tensor<string, []>("op_259_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_259_cast_fp16 = slice_by_index(begin = var_259_begin_0, end = var_259_end_0, end_mask = var_259_end_mask_0, squeeze_mask = var_259_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_259_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_11_cast_fp16 = add(x = var_257_cast_fp16, y = var_259_cast_fp16)[name = tensor<string, []>("hidden_state_11_cast_fp16")];
            tensor<int32, [3]> var_262_begin_0 = const()[name = tensor<string, []>("op_262_begin_0"), val = tensor<int32, [3]>([0, 4, 0])];
            tensor<int32, [3]> var_262_end_0 = const()[name = tensor<string, []>("op_262_end_0"), val = tensor<int32, [3]>([1, 5, 16])];
            tensor<bool, [3]> var_262_end_mask_0 = const()[name = tensor<string, []>("op_262_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_262_squeeze_mask_0 = const()[name = tensor<string, []>("op_262_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_262_cast_fp16 = slice_by_index(begin = var_262_begin_0, end = var_262_end_0, end_mask = var_262_end_mask_0, squeeze_mask = var_262_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<int32, [1]> var_264_axes_0 = const()[name = tensor<string, []>("op_264_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_264_cast_fp16 = expand_dims(axes = var_264_axes_0, x = var_262_cast_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<bool, []> var_265_transpose_x_0 = const()[name = tensor<string, []>("op_265_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_265_transpose_y_0 = const()[name = tensor<string, []>("op_265_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> var_265_cast_fp16 = matmul(transpose_x = var_265_transpose_x_0, transpose_y = var_265_transpose_y_0, x = hidden_state_11_cast_fp16, y = var_264_cast_fp16)[name = tensor<string, []>("op_265_cast_fp16")];
            tensor<int32, [1]> var_266_axes_0 = const()[name = tensor<string, []>("op_266_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256]> var_266_cast_fp16 = squeeze(axes = var_266_axes_0, x = var_265_cast_fp16)[name = tensor<string, []>("op_266_cast_fp16")];
            tensor<int32, [4]> var_268_begin_0 = const()[name = tensor<string, []>("op_268_begin_0"), val = tensor<int32, [4]>([0, 5, 0, 0])];
            tensor<int32, [4]> var_268_end_0 = const()[name = tensor<string, []>("op_268_end_0"), val = tensor<int32, [4]>([1, 6, 256, 16])];
            tensor<bool, [4]> var_268_end_mask_0 = const()[name = tensor<string, []>("op_268_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_268_squeeze_mask_0 = const()[name = tensor<string, []>("op_268_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_268_cast_fp16 = slice_by_index(begin = var_268_begin_0, end = var_268_end_0, end_mask = var_268_end_mask_0, squeeze_mask = var_268_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_268_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_269_cast_fp16 = mul(x = var_268_cast_fp16, y = hidden_state_11_cast_fp16)[name = tensor<string, []>("op_269_cast_fp16")];
            tensor<int32, [4]> var_271_begin_0 = const()[name = tensor<string, []>("op_271_begin_0"), val = tensor<int32, [4]>([0, 5, 0, 0])];
            tensor<int32, [4]> var_271_end_0 = const()[name = tensor<string, []>("op_271_end_0"), val = tensor<int32, [4]>([1, 6, 1, 16])];
            tensor<bool, [4]> var_271_end_mask_0 = const()[name = tensor<string, []>("op_271_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_271_squeeze_mask_0 = const()[name = tensor<string, []>("op_271_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_271_cast_fp16 = slice_by_index(begin = var_271_begin_0, end = var_271_end_0, end_mask = var_271_end_mask_0, squeeze_mask = var_271_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_271_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_13_cast_fp16 = add(x = var_269_cast_fp16, y = var_271_cast_fp16)[name = tensor<string, []>("hidden_state_13_cast_fp16")];
            tensor<int32, [3]> var_274_begin_0 = const()[name = tensor<string, []>("op_274_begin_0"), val = tensor<int32, [3]>([0, 5, 0])];
            tensor<int32, [3]> var_274_end_0 = const()[name = tensor<string, []>("op_274_end_0"), val = tensor<int32, [3]>([1, 6, 16])];
            tensor<bool, [3]> var_274_end_mask_0 = const()[name = tensor<string, []>("op_274_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_274_squeeze_mask_0 = const()[name = tensor<string, []>("op_274_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_274_cast_fp16 = slice_by_index(begin = var_274_begin_0, end = var_274_end_0, end_mask = var_274_end_mask_0, squeeze_mask = var_274_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_274_cast_fp16")];
            tensor<int32, [1]> var_276_axes_0 = const()[name = tensor<string, []>("op_276_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_276_cast_fp16 = expand_dims(axes = var_276_axes_0, x = var_274_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<bool, []> var_277_transpose_x_0 = const()[name = tensor<string, []>("op_277_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_277_transpose_y_0 = const()[name = tensor<string, []>("op_277_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> var_277_cast_fp16 = matmul(transpose_x = var_277_transpose_x_0, transpose_y = var_277_transpose_y_0, x = hidden_state_13_cast_fp16, y = var_276_cast_fp16)[name = tensor<string, []>("op_277_cast_fp16")];
            tensor<int32, [1]> var_278_axes_0 = const()[name = tensor<string, []>("op_278_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256]> var_278_cast_fp16 = squeeze(axes = var_278_axes_0, x = var_277_cast_fp16)[name = tensor<string, []>("op_278_cast_fp16")];
            tensor<int32, [4]> var_280_begin_0 = const()[name = tensor<string, []>("op_280_begin_0"), val = tensor<int32, [4]>([0, 6, 0, 0])];
            tensor<int32, [4]> var_280_end_0 = const()[name = tensor<string, []>("op_280_end_0"), val = tensor<int32, [4]>([1, 7, 256, 16])];
            tensor<bool, [4]> var_280_end_mask_0 = const()[name = tensor<string, []>("op_280_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_280_squeeze_mask_0 = const()[name = tensor<string, []>("op_280_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_280_cast_fp16 = slice_by_index(begin = var_280_begin_0, end = var_280_end_0, end_mask = var_280_end_mask_0, squeeze_mask = var_280_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_280_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_281_cast_fp16 = mul(x = var_280_cast_fp16, y = hidden_state_13_cast_fp16)[name = tensor<string, []>("op_281_cast_fp16")];
            tensor<int32, [4]> var_283_begin_0 = const()[name = tensor<string, []>("op_283_begin_0"), val = tensor<int32, [4]>([0, 6, 0, 0])];
            tensor<int32, [4]> var_283_end_0 = const()[name = tensor<string, []>("op_283_end_0"), val = tensor<int32, [4]>([1, 7, 1, 16])];
            tensor<bool, [4]> var_283_end_mask_0 = const()[name = tensor<string, []>("op_283_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_283_squeeze_mask_0 = const()[name = tensor<string, []>("op_283_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_283_cast_fp16 = slice_by_index(begin = var_283_begin_0, end = var_283_end_0, end_mask = var_283_end_mask_0, squeeze_mask = var_283_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_283_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_15_cast_fp16 = add(x = var_281_cast_fp16, y = var_283_cast_fp16)[name = tensor<string, []>("hidden_state_15_cast_fp16")];
            tensor<int32, [3]> var_286_begin_0 = const()[name = tensor<string, []>("op_286_begin_0"), val = tensor<int32, [3]>([0, 6, 0])];
            tensor<int32, [3]> var_286_end_0 = const()[name = tensor<string, []>("op_286_end_0"), val = tensor<int32, [3]>([1, 7, 16])];
            tensor<bool, [3]> var_286_end_mask_0 = const()[name = tensor<string, []>("op_286_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_286_squeeze_mask_0 = const()[name = tensor<string, []>("op_286_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_286_cast_fp16 = slice_by_index(begin = var_286_begin_0, end = var_286_end_0, end_mask = var_286_end_mask_0, squeeze_mask = var_286_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_286_cast_fp16")];
            tensor<int32, [1]> var_288_axes_0 = const()[name = tensor<string, []>("op_288_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_288_cast_fp16 = expand_dims(axes = var_288_axes_0, x = var_286_cast_fp16)[name = tensor<string, []>("op_288_cast_fp16")];
            tensor<bool, []> var_289_transpose_x_0 = const()[name = tensor<string, []>("op_289_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_289_transpose_y_0 = const()[name = tensor<string, []>("op_289_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 1]> var_289_cast_fp16 = matmul(transpose_x = var_289_transpose_x_0, transpose_y = var_289_transpose_y_0, x = hidden_state_15_cast_fp16, y = var_288_cast_fp16)[name = tensor<string, []>("op_289_cast_fp16")];
            tensor<int32, [1]> var_290_axes_0 = const()[name = tensor<string, []>("op_290_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256]> var_290_cast_fp16 = squeeze(axes = var_290_axes_0, x = var_289_cast_fp16)[name = tensor<string, []>("op_290_cast_fp16")];
            tensor<int32, [4]> var_292_begin_0 = const()[name = tensor<string, []>("op_292_begin_0"), val = tensor<int32, [4]>([0, 7, 0, 0])];
            tensor<int32, [4]> var_292_end_0 = const()[name = tensor<string, []>("op_292_end_0"), val = tensor<int32, [4]>([1, 8, 256, 16])];
            tensor<bool, [4]> var_292_end_mask_0 = const()[name = tensor<string, []>("op_292_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_292_squeeze_mask_0 = const()[name = tensor<string, []>("op_292_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 256, 16]> var_292_cast_fp16 = slice_by_index(begin = var_292_begin_0, end = var_292_end_0, end_mask = var_292_end_mask_0, squeeze_mask = var_292_squeeze_mask_0, x = clip_1_to_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<fp16, [1, 256, 16]> var_293_cast_fp16 = mul(x = var_292_cast_fp16, y = hidden_state_15_cast_fp16)[name = tensor<string, []>("op_293_cast_fp16")];
            tensor<int32, [4]> var_295_begin_0 = const()[name = tensor<string, []>("op_295_begin_0"), val = tensor<int32, [4]>([0, 7, 0, 0])];
            tensor<int32, [4]> var_295_end_0 = const()[name = tensor<string, []>("op_295_end_0"), val = tensor<int32, [4]>([1, 8, 1, 16])];
            tensor<bool, [4]> var_295_end_mask_0 = const()[name = tensor<string, []>("op_295_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<bool, [4]> var_295_squeeze_mask_0 = const()[name = tensor<string, []>("op_295_squeeze_mask_0"), val = tensor<bool, [4]>([false, true, false, false])];
            tensor<fp16, [1, 1, 16]> var_295_cast_fp16 = slice_by_index(begin = var_295_begin_0, end = var_295_end_0, end_mask = var_295_end_mask_0, squeeze_mask = var_295_squeeze_mask_0, x = delta_B_u_1_cast_fp16)[name = tensor<string, []>("op_295_cast_fp16")];
            tensor<fp16, [1, 256, 16]> hidden_state_17_cast_fp16 = add(x = var_293_cast_fp16, y = var_295_cast_fp16)[name = tensor<string, []>("hidden_state_17_cast_fp16")];
            tensor<int32, [3]> var_298_begin_0 = const()[name = tensor<string, []>("op_298_begin_0"), val = tensor<int32, [3]>([0, 7, 0])];
            tensor<int32, [3]> var_298_end_0 = const()[name = tensor<string, []>("op_298_end_0"), val = tensor<int32, [3]>([1, 8, 16])];
            tensor<bool, [3]> var_298_end_mask_0 = const()[name = tensor<string, []>("op_298_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<bool, [3]> var_298_squeeze_mask_0 = const()[name = tensor<string, []>("op_298_squeeze_mask_0"), val = tensor<bool, [3]>([false, true, false])];
            tensor<fp16, [1, 16]> var_298_cast_fp16 = slice_by_index(begin = var_298_begin_0, end = var_298_end_0, end_mask = var_298_end_mask_0, squeeze_mask = var_298_squeeze_mask_0, x = C_proj_1_cast_fp16)[name = tensor<string, []>("op_298_cast_fp16")];
            tensor<int32, [1]> var_300_axes_0 = const()[name = tensor<string, []>("op_300_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 16, 1]> var_300_cast_fp16 = expand_dims(axes = var_300_axes_0, x = var_298_cast_fp16)[name = tensor<string, []>("op_300_cast_fp16")];
